{
    "Anal Canal Anatomy": {
        "description": "The anal canal is the most terminal part of the lower GI tract/large intestine, which lies between the anal verge (anal orifice, anus) in the perineum below and the rectum above. The description in this topic is from below upwards, as that is how this region is usually examined in clinical practice. Images depicting the anal canal can be seen below.\n [1, 2]  The pigmented, keratinized perianal skin of the buttocks (around the anal verge) has skin appendages (eg, hair, sweat glands, sebaceous glands); compare this with the anal canal skin above the anal verge, which is also pigmented and keratinized but does not have skin appendages.\n [3, 4] The demarcation between the rectum above and the anal canal below is the anorectal ring or anorectal flexure, where the puborectalis muscle forms a sling around the posterior aspect of the anorectal junction, kinking it anteriorly. The anal canal is completely extraperitoneal. The length of the anal canal is about 4 cm (range, 3-5 cm), with two thirds of this being above the pectinate line (also known as the dentate line) and one third below the pectinate line. The epithelium of the anal canal between the anal verge below and the pectinate line above is variously described as anal mucosa or anal skin. The author believes that it should be called anal skin (anoderm), as it looks like (pigmented) skin, is sensitive like skin (why a fissure-in-ano is very painful), and is keratinized (but does not have skin appendages). The pectinate line is the site of transition of the proctodeum below and the postallantoic gut above. It is a scalloped demarcation formed by the anal valves (transverse folds of mucosa) at the inferior-most ends of the anal columns. Anal glands open above the anal valves into the anal sinuses. The pectinate line is not seen on inspection in clinical practice, but under anesthesia the anal canal descends down, and the pectinate line can be seen on slight retraction of the anal canal skin. The anal canal just above the pectinate line for about 1-2 cm is called the anal pecten or transitional zone. Above this transitional zone, the anal canal is lined with columnar epithelium (which is insensitive to cutting). Anal columns (of Morgagni) are 6-10 longitudinal (vertical) mucosal folds in the upper part of the anal canal. At the bottom of these columns are anal sinuses or crypts, into which open the anal glands and anal papillae. Infection of the anal glands is likely the initial event in causation of perianal abscess and fistula-in-ano. Three of these columns (left lateral, right posterior, and right anterior, at 3-, 7-, and 11-o’clock positions in supine position) are prominent; they are called anal cushions and contain branches and tributaries of superior rectal (hemorrhoidal) artery and vein. When prominent, veins in these cushions form the internal hemorrhoids. The anorectal junction or anorectal ring is situated about 5 cm from the anus. At the anorectal flexure or angle, the anorectal junction is pulled anterosuperiorly by the puborectal sling to continue below as the anal canal. Levator ani and coccygeus muscles form the pelvic diaphragm. Lateral to the anal canal are the pyramidal ischioanal (ischiorectal) fossae (1 on either side), below the pelvic diaphragm and above the perianal skin. The paired ischioanal fossae communicate with each other behind the anal canal. The anterior relations of the anal canal are, in males, the seminal vesicles, prostate, and urethra, and, in females, the cervix and vagina with perineal body in between. In front of (anterior to) the anal canal is the rectovesical fascia (of Denonvilliers), and behind (posterior) is the presacral endopelvic fascia (of Waldeyer), under which lie a rich presacral plexus of veins. Posterior to the anal canal lie the tip of the coccyx (joined to it by the anococcygeal ligament) and lower sacrum. The anal canal is surrounded by several perianal spaces: subcutaneous, submucosal, intersphincteric, ischioanal (rectal) and pelvirectal. The anal canal above the pectinate line is supplied by the terminal branches of the superior rectal (hemorrhoidal) artery, which is the terminal branch of the inferior mesenteric artery. The middle rectal artery (a branch of the internal iliac artery) and the inferior rectal artery (a branch of the internal pudendal artery) supply the lower anal canal. Beneath the anal canal skin (below the pectinate line) lies the external hemorrhoidal plexus of veins, which drains into systemic veins. Beneath the anal canal mucosa (above the pectinate line) lies the internal hemorrhoidal plexus of veins, which drains into the portal system of veins. The anal canal is, therefore, an important area of portosystemic venous connection (the other being the esophagogastric junction). Lymphatics from the anal canal drain into the superficial inguinal group of lymph nodes. Anorectal sphincter tone can be assessed during digital rectal examination (DRE) when the patient is asked to squeeze the examining finger. Anorectal manometry measures the pressures: resting and squeezing. The anal canal below the pectinate line develops from the proctodeum (ectoderm), while that above the pectinate line develops from the endoderm of the hindgut.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/45/71345tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/65/13265tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/66/13266tn.jpg"
        ]
    },
    "Ankle Joint Anatomy": {
        "description": "The ankle joint is a hinged synovial joint with primarily up-and-down movement (plantarflexion and dorsiflexion). However, when the range of motion of the ankle and subtalar joints (talocalcaneal and talocalcaneonavicular) is taken together, the complex functions as a universal joint (see the image below). The combined movement in the dorsiflexion and plantarflexion directions is greater than 100°; bone-on-bone abutment beyond this range protects the anterior and posterior ankle capsular ligaments from injury. The anterior and posterior ankle capsular ligaments are relatively thin compared with the medial and lateral ankle ligaments. Type I collagen tissue constitutes the bulk of the capsule and supporting ligaments of the ankle joint. The fiber density and orientation are arranged dynamically according to the typical mechanical stress experienced by the joint. Within limits, the greater the excursion of the joint capsule and ligaments, the less likely sprains are to occur. With increased motion, the muscles absorb the mechanical force energy without exceeding the tensile limits of either the joint capsule or the ligaments.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/59/12459tn.jpg"
        ]
    },
    "Aortic Valve Anatomy": {
        "description": "The normal human heart contains 4 valves that regulate blood flow into and out of the heart. The aortic and pulmonic valves are known as the semilunar valves, whereas the tricuspid and mitral valves are referred to as the atrioventricular valves. All the valves are trileaflet, with the exception of the mitral valve, which has 2 leaflets. Cardiac valves are surrounded by fibrous tissue forming partial or complete valvular rings, or annuli. These annuli join the fibrous skeleton of the heart to anchor and support the valvular structures. The aortic valve is located between the left ventricular outflow tract and the ascending aorta. The aortic valve is the cardiac centerpiece. Relative to the aorta, the mitral valve is located posterior and to the left, the tricuspid valve is located inferiorly and to the right, and both valves abut on the posteroinferior margins of the aortic root, albeit with the atrioventricular separating structures interposing between the root and the tricuspid valve.\n [1, 2] In most cases, the orifices of the coronary arteries arise within the 2 anterior sinuses of Valsalva, usually positioned just below the sinotubular junction.\n [3, 4, 5]  However, arteries can occasionally be positioned superior relative to the sinotubular junction. As a result of the semilunar attachment of the aortic valvar leaflets, 3 triangular extensions of the left ventricular outflow tract reach the level of the sinotubular junction.\n [6]  These triangles are formed of thinned fibrous walls of the aorta between the expanded sinuses of Valsalva. Their most apical regions represent areas of potential communication with the pericardial space and, in the case of the triangle between the right and left coronary aortic leaflets, with the plane of tissue interposed between the aorta and anteriorly located sleeve-like subpulmonary infundibulum. The 2 interleaflet triangles bordering the noncoronary leaflet are also in fibrous continuity with the fibrous trigones, the mitral valve, and the membranous septum. Semilunar valve formation begins during the fourth week of gestation. At this time, opposing dextrosuperior and sinistroinferior endocardial cushions appear in the cephalad portion of the truncus arteriosus. Simultaneously, 2 additional intercalated endocardial cushions form, each located 90º from the aforementioned dextrosuperior and sinistroinferior endocardial cushions. The dextrosuperior and sinistroinferior cushions fuse and, in doing so, form the truncal septum. The truncal septum undergoes a complex process of differentiation, eventually forming the right and left aortic valve cusps and 2 leaflets of the pulmonic valve. Of the 2 intercalated endocardial cushions, the right cushion eventually forms the posterior aortic valve cusp, whereas the left forms the anterior pulmonic valve leaflet. This occurs during the counterclockwise rotation and caudal shift of the conotruncus. During this time, the endocardial cushions also undergo dedifferentiation from a myosin-heavy chain to an alpha-smooth muscle actin phenotype, resulting in mature arterial valvular leaflets. The improper fusion or the incomplete dedifferentiation of the previously mentioned endocardial cushions is thought to be responsible for the formation of anatomically and structurally congenitally abnormal aortic valves.\n [7, 8, 9] The following image is an overview of the transitions occurring in early heart development in amniotes (see the image below). Within the right atrium, the atrioventricular node is located within the triangle of Koch. This important triangle is demarcated by the tendon of Todaro, the attachment of the septal leaflet of the tricuspid valve, and the orifice of the coronary sinus. The apex of this triangle is occupied by the atrioventricular component of the membranous septum. The atrioventricular node is located just inferior to the apex of the triangle adjacent to the membranous septum; therefore, the atrioventricular node is in close proximity to the subaortic region and membranous septum of the left ventricular outflow tract. This relationship explains the risk of developing complete heart block or conduction abnormality in patients who suffer from various pathologies involving the aortic valve. The atrioventricular node continues as the bundle of His, piercing the membranous septum and penetrating to the left through the central fibrous body, which runs superficially along the crest of the ventricular septum, giving rise to the fascicles of the left bundle branch.\n [10] The triangle between the right and noncoronary sinus is in close proximity to the bundle of His as it courses through the central fibrous body just below the inferior margin of the membranous ventricular septum, which can be of clinical significance in patients with endocarditis.\n [11]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/05/12305tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/07/12307tn.jpg"
        ]
    },
    "Arterial Supply Anatomy": {
        "description": "Arteries are the large vessels that carry oxygenated blood away from the heart (except for the pulmonary circuit, in which the arterial blood is deoxygenated). The distribution of the systemic arteries is like a ramified tree, the common trunk of which, formed by the aorta, commences at the left ventricle, while the smallest ramifications extend to the peripheral parts of the body and the contained organs (see the image below). The arteries, in their distribution, communicate with one another (forming what are called anastomoses) and end in minute vessels, called arterioles, which in their turn open into a close-meshed network of microscopic vessels, termed capillaries, the true deliverers of oxygen and nutrients to the cells. Arteries are found in all parts of the body, except in the hairs, nails, epidermis, cartilages, and cornea. The larger trunks usually occupy the most protected situations; in the limbs, they run along the flexor surface, where they are less exposed to injury.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/12/12012tn.jpg"
        ]
    },
    "Arteries to the Brain and Meninges": {
        "description": "Comprehensive knowledge of anatomy forms the basis for understanding and treatment of neurological disease. Intracranial arteries are involved in many neurologic disorders. Knowledge of arterial anatomy, variants, and areas involved in disease is essential to define the location of neurovascular lesions, delineate the extent and involvement of branching perforators, and assess the effects on downstream perfusion. Arterial anatomy adds to the complexity of neurologic localization, providing a unique classification of neurovascular disorders. Arterial anatomy is also intertwined with pathophysiology, as vessel morphology influences hemodynamic variables. Only marginal advances regarding pathology of these arterial segments has been made since autopsy series performed hundreds of years ago. Angiography and numerous noninvasive imaging methods have been developed to image intracranial arterial anatomy,\n [1, 2] yet these modern vascular imaging techniques including transcranial Doppler (TCD) ultrasonography, computed tomographic angiography (CTA), and magnetic resonance angiography (MRA) are not as accurate as the gold standard of conventional or digital subtraction angiography (DSA) (see the image below).",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/08/12308tn.jpg"
        ]
    },
    "Auditory System Anatomy": {
        "description": "This article discusses the anatomy of the auditory pathway (see the following images), as well as a few physiologic considerations and clinical applications. The eighth cranial nerve (CN VIII) or vestibulocochlear nerve is composed of 2 different sets of fibers: (1) the cochlear nerve and (2) the vestibular nerve. These 2 nerves are anatomically and physiologically different. The peripheral segments of the cochlear and vestibular nerves join at the lateral part of the internal auditory canal (IAC) to form the vestibulocochlear nerve. They are also joined by the facial nerve in the IAC.\n [1, 2] The length of the vestibulocochlear nerve, from the glial-Schwann junction to the brainstem, is 10-13 mm in the human male and 7-10 mm in females.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/16/12616tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/17/12617tn.jpg"
        ]
    },
    "Autonomic Nervous System Anatomy": {
        "description": "The autonomic nervous system (ANS) is a very complex, multifaceted neural network that maintains internal physiologic homeostasis. This network includes cardiovascular, thermoregulatory, GI, genitourinary (GU), and ophthalmologic (pupillary) systems (see the following image). Given the complex nature of this system, a stepwise approach to autonomic disorders is required for proper understanding. The goal for this article remains focused at step III on the anatomy of the autonomic nervous system, as follows. Step I - Understand the reason for testing Step II - Recognition and etiology (especially small fiber neuropathy [SFN]) Step III - Understand basic anatomy and neurophysiology Step IV - Learn the methods for testing Step V - Diagnosis and management Almost 10% of the population (or > 30 million people in the US) may acquire an autonomic disorder requiring medical attention. Because the autonomic nervous system maintains internal physiologic homeostasis, disorders of this system can be present with both central as well as peripheral nervous system localization. The etiology of autonomic dysfunction can be primary or idiopathic and secondary causes. Autonomic failure is seen in multiple system atrophy, pure or progressive autonomic failure, Parkinson and other neurodegenerative diseases, metabolic diseases such as Wernicke and cobalamin deficiency, diabetes mellitus, hyperlipidemia, trauma, vascular diseases, neoplastic diseases, and multiple sclerosis. In addition, autonomic dysfunction is associated with various medications. In addition to diabetes, autonomic dysfunction is associated with other neuropathies, including Guillain-Barré syndrome, Lyme disease, human immunodeficiency virus (HIV) infection, leprosy, acute idiopathic dysautonomia, amyloidosis, porphyria, uremia, and alcoholism. Besides nerve localization in the peripheral nervous system, it occurs in diseases of the presynaptic neuromuscular junction such as botulism and myasthenic syndrome. In addition to the acquired causes, inherited disorders like hereditary sensory-autonomic neuropathy (HSAN), familial amyloid polyneuropathy (FAP), Tangier disease, and Fabry disease also exist. Clinically, postural lightheadedness, dry mouth, dry eyes, impotence, loss of sweating or hyperthermia, nocturnal diarrhea, gastroparesis, impaired accommodation, urinary or bowel incontinence, and small fiber neuropathy are some of the presenting symptoms. Most peripheral neuropathies affect all fiber sizes. Few peripheral neuropathies are associated with pure or predominantly small fiber involvement. A large proportion is associated with diabetes. Painful burning feet is caused by a sensory neuropathy with small fiber involvement in more than 90% of cases. Patients with pure small fiber involvement display normal large fiber function. Muscle bulk, strength, muscle stretch reflexes, and large fiber sensory function (ie, vibration, proprioception) are normal. Small fibers are both myelinated and unmyelinated. Small myelinated fibers transmit preganglionic autonomic efferents (B fibers) and somatic afferents (A delta fibers). Unmyelinated (C) fibers transmit postganglionic autonomic efferents as well as somatic and autonomic afferents. Both A delta and C fibers are widely distributed in skin and deep tissues. The neurotransmitter for preganglionic sympathetic and parasympathetic nervous system (PNS) as well as postganglionic parasympathetic nervous system is acetylcholine (ACh). The neurotransmitter for the postganglionic sympathetic nervous system (innervating sweat glands) is also acetylcholine, whereas that for the remaining postganglionic sympathetic nervous system is norepinephrine (NE). Electromyography (EMG) plays a key role in the evaluation of most peripheral neuropathies and helps in assessing only large myelinated fibers. Thus, pure small fiber neuropathies may be associated with normal findings on routine electrophysiologic studies. Elderly patients who lack sural sensory responses can still be diagnosed with small fiber neuropathy. Patients with symptoms other than neuropathic ones certainly need autonomic function testing for appropriate diagnosis.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/14/12314tn.jpg"
        ]
    },
    "Bladder Anatomy": {
        "description": "The bladder is an extraperitoneal muscular urine reservoir that lies behind the pubic symphysis in the pelvis. A normal bladder functions through a complex coordination of musculoskeletal, neurologic, and psychological functions that allow filling and emptying of the bladder contents. The prime effector of continence is the synergic relaxation of detrusor muscles and contraction of the bladder neck and pelvic floor muscles. This occurs during bladder filling and urine storage. See the image below. The normal adult bladder accommodates 300-600 mL of urine. A central nervous system response is usually triggered when the volume reaches 400 mL and is perceived as the sensation of bladder fullness and the need to void. However, urination can be prevented by cortical suppression of the peripheral nervous system or by voluntary contraction of the external urethral sphincter.\n [1]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/21/12721tn.jpg"
        ]
    },
    "Bone Marrow Anatomy": {
        "description": "Bone marrow is the soft, spongy, gelatinous tissue found in the hollow spaces in the interior of bones.\n [1] The average weight of this tissue is about 4% of the total body weight, or 2.6 kg in an adult weighing 65 kg. Progenitor cell (stem cell) lines in the bone marrow produce new blood cells and stromal cells. Bone marrow is also an important part of the lymphatic system. Bone marrow consists of stem cells, which are large, \"primitive,\" undifferentiated cells supported by fibrous tissue called stroma. There are 2 main types of stem cells and, therefore, the bone marrow consists of 2 types of cellular tissue. One type of stem cell is involved in producing blood cells and the other is involved in producing stromal cells, which are responsible for the supporting stroma.",
        "image_urls": []
    },
    "Brachial Plexus Anatomy": {
        "description": "The brachial plexus (plexus brachialis) is a somatic nerve plexus formed by intercommunications among the ventral rami (roots) of the lower 4 cervical nerves (C5-C8) and the first thoracic nerve (T1). The plexus, depicted in the images below, is responsible for the motor innervation of all of the muscles of the upper extremity, with the exception of the trapezius and levator scapula.\n [1] The brachial plexus supplies all of the cutaneous innervation of the upper limb, except for the area of the axilla (which is supplied by the supraclavicular nerve) and the dorsal scapula area, which is supplied by cutaneous branches of the dorsal rami. The brachial plexus communicates with the sympathetic trunk via gray rami communicantes, which join the roots of the plexus. They are derived from the middle and inferior cervical sympathetic ganglia and the first thoracic sympathetic ganglion.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/87/11487tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/88/11488tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/90/11490tn.jpg"
        ]
    },
    "Brain Anatomy": {
        "description": "The central nervous system consists of the brain and the spinal cord. The peripheral nervous system consists of the extensions of neural structures beyond the central nervous system and includes somatic and autonomic divisions. The brain is composed of 3 main structural divisions: the cerebrum, the brainstem, and the cerebellum (see the images below). At the base of the brain is the brainstem, which extends from the upper cervical spinal cord to the diencephalon of the cerebrum. The brainstem is divided into the medulla, pons, and midbrain. Posterior to the brainstem lies the cerebellum.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/13/12013tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/14/12014tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/15/12015tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/16/12016tn.jpg"
        ]
    },
    "Breast Anatomy": {
        "description": "Breast shape varies among patients, but knowing and understanding the anatomy of the breast ensures safe surgical planning (see the image below). When the breasts are carefully examined, significant asymmetries are revealed in most patients. Any preexisting asymmetries, spinal curvature, or chest wall deformities must be recognized and demonstrated to the patient, as these may be difficult to correct and can become noticeable in the postoperative period. Preoperative photographs with multiple views are obtained on all patients and maintained as part of the office record.\n [1, 2, 3, 4, 5, 6, 7]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/44/7944tn.jpg"
        ]
    },
    "Bronchial Anatomy": {
        "description": "The tracheobronchial tree is the anatomical and functional segment of the respiratory system that conducts air from the upper airways to the lung parenchyma. It is composed of the trachea and the intrapulmonary airways, including the bronchi, bronchioles and respiratory bronchioles. Different histological characteristics are seen at each level and serve specific purposes.\n [1] The trachea and bronchi (from the Greek bronkhos, meaning \"windpipe\") have cartilaginous walls. Bronchi undergo multiple divisions and eventually give rise to the terminal bronchioles, which by definition, lack cartilage. The most distal respiratory bronchioles and alveoli are in charge of gas exchange.\n [2]",
        "image_urls": []
    },
    "Cardiovascular System Anatomy": {
        "description": "The cardiovascular system consists of the heart, which is an anatomical pump, with its intricate conduits (arteries, veins, and capillaries) that traverse the whole human body carrying blood. The blood contains oxygen, nutrients, wastes, and immune and other functional cells that help provide for homeostasis and basic functions of human cells and organs.\n [1, 2] The pumping action of the heart usually maintains a balance between cardiac output and venous return. Cardiac output (CO) is the amount of blood pumped out by each ventricle in one minute. The normal adult blood volume is 5 liters (a little over 1 gallon) and it usually passes through the heart once a minute. Note that cardiac output varies with the demands of the body.\n [3] The cardiac cycle refers to events that occur during one heart beat and is split into ventricular systole (contraction/ejection phase) and diastole (relaxation/filling phase). A normal heart rate is approximately 72 beats/minute, and the cardiac cycle spreads over 0.8 seconds. The heart sounds transmitted are due to closing of heart valves, and abnormal heart sounds, called murmurs, usually represent valve incompetency or abnormalities.\n [4] Blood is transported through the whole body by a continuum of blood vessels. Arteries are blood vessels that transport blood away from the heart, and veins transport the blood back to the heart. Capillaries carry blood to tissue cells and are the exchange sites of nutrients, gases, wastes, etc.\n [5]",
        "image_urls": []
    },
    "Central Nervous System Anatomy": {
        "description": "The nervous system is organized into two parts: the central nervous system, which consists of the brain and the spinal cord, and the peripheral nervous system, which connects the central nervous system to the rest of the body. An image depicting the central nervous system can be seen below. In the central nervous system, the brain and spinal cord are the main centers where correlation and integration of nervous information occur. Both the brain and spinal cord are covered with a system of membranes, called meninges, and are suspended in the cerebrospinal fluid; they are further protected by the bones of the skull and the vertebral column. The central nervous system is composed of large numbers of excitable nerve cells and their processes, called neurons, which are supported by specialized tissue called neuroglia. The long processes of a nerve cell are called axons or nerve fibers. The interior of the central nervous system is organized into gray and white matter. Gray matter consists of nerve cells embedded in neuroglia; it has a gray color. White matter consists of nerve fibers embedded in neuroglia; it has a white color due to the presence of lipid material in the myelin sheaths of many of the nerve fibers. The billions of neurons in the brain are connected to neurons throughout the body by trillions of synapses.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/27/12627tn.jpg"
        ]
    },
    "Cervical Spine Anatomy": {
        "description": "The cervical spine is made up of 7 vertebrae. The first 2, C1 and C2, are highly specialized and are given unique names: atlas and axis, respectively. C3-C7 are more classic vertebrae, having a body, pedicles, laminae, spinous processes, and facet joints. C1 and C2 form a unique set of articulations that provide a great degree of mobility for the skull. C1 serves as a ring or washer that the skull rests upon and articulates in a pivot joint with the dens or odontoid process of C2. Approximately 50% of flexion extension of the neck happens between the occiput and C1; 50% of the rotation of the neck happens between C1 and C2. The cervical spine is much more mobile than the thoracic or lumbar regions of the spine. Unlike the other parts of the spine, the cervical spine has transverse foramina in each vertebra for the vertebral arteries that supply blood to the brain.",
        "image_urls": []
    },
    "Chest Wall Anatomy": {
        "description": "The chest wall is comprised of skin, fat, muscles, and the thoracic skeleton. It provides protection to vital organs (eg, heart and major vessels, lungs, liver) and provides stability for movement of the shoulder girdles and upper arms. Although the thoracic skeleton consists of rigid bones and cartilage, its interconnection with the muscular components forms for a dynamic structure that is able to expand during inspiration, thereby increasing intrathoracic volume and allowing for maximal breaths to take place. An in-depth understanding of chest wall anatomy is paramount to those performing any surgical procedure of the chest or breast.",
        "image_urls": []
    },
    "Circle of Willis Anatomy": {
        "description": "The circle of Willis encircles the stalk of the pituitary gland and provides important communications between the blood supply of the forebrain and hindbrain (ie, between the internal carotid and vertebro-basilar systems following obliteration of primitive embryonic connections).\n [1]  Although a complete circle of Willis is present in some individuals, it is rarely seen radiographically in its entirety; anatomical variations are very common and a well-developed communication between each of its parts is identified in less than half of the population.\n [1] The circle of Willis begins to form when the right and left internal carotid artery (ICA) enters the cranial cavity and each one divides into two main branches: the anterior cerebral artery (ACA) and middle cerebral artery (MCA).\n [2] The anterior cerebral arteries are then united and blood can cross flow by the anterior communicating (ACOM) artery. The ACAs supply most midline portions of the frontal lobes and superior medial parietal lobes. The MCAs supply most of the lateral surface of the hemisphere, except the superior portion of the parietal lobe (via ACA) and the inferior portion of the temporal lobe and occipital lobe. The ACAs, ACOM, and MCAs form the anterior half, better known as the anterior cerebral circulation. Posteriorly, the basilar artery (BA), formed by the left and right vertebral arteries, branches into a left and right posterior cerebral artery (PCA), forming the posterior circulation.\n [3] The PCAs mostly supply blood to the occipital lobe and inferior portion of the temporal lobe. The PCAs complete the circle of Willis by joining the anterior circulation formed by the ICAs via the posterior communicating (PCOM) arteries. See the images below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/08/63308tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/85/11485tn.jpg"
        ]
    },
    "Colon Anatomy": {
        "description": "The colon is a 5-6–ft long, inverted, U-shaped part of the large intestine (lower gastrointestinal tract). By definition, the cecum (and appendix) and ano-rectum, which are parts of the large intestine, are not included in the colon. Embryologically, the colon develops partly from the midgut (ascending colon to proximal transverse colon) and partly from the hind gut (distal transverse colon to sigmoid colon). On plain abdominal radiographs, the colon is seen to be filled with air and some fecal material. The colon is identified with haustra (irregular incomplete sacculations confer regular complete valvulae conniventes in jejunum). The colon anatomy is displayed in the image below. The ascending (right) colon lies vertically in the most lateral right part of the abdominal cavity, occupying the right iliac fossa, right lumbar region and right hypochondrium. The proximal blind end (pouch) of the ascending colon is called the cecum. The ascending colon takes a right-angled turn just below the liver (right colic or hepatic flexure) and becomes the transverse colon, which has a horizontal course from right to left, occupying the right hypochondrium, epigastrium, and left hypochondrium. The transverse colon again takes a right-angled turn just below the spleen (left colic or splenic flexure, which is attached to the diaphragm by the phrenocolic ligament) and becomes the descending (left) colon, which lies vertically in the most lateral left part of the abdominal cavity, occupying the left hypochondrium, left lumbar region, and left iliac fossa. Splenic flexure is higher (cranial) to hepatic flexure. The descending colon leads to the inverted V-shaped sigmoid colon, which then becomes the rectum at the S3 level; the sigmoid colon is so called because of its S-shape.\n [1, 2, 3, 4, 5] Lateral to ascending and descending colon are the right and left paracolic gutters of the peritoneal cavity, through which fluid/pus in the upper abdomen can trickle down into the pelvic cavity. The ascending and descending colon are related to the kidney, ureter, and gonadal vessels of the corresponding side that lie behind them in the retroperitoneum; the ascending colon is also related to the C loop (second part) of the duodenum. The transverse colon and the sigmoid colon have a mesentery (ie, transverse mesocolon and sigmoid mesocolon, respectively), but the ascending colon and descending colon are retroperitoneal, while the cecum is intraperitoneal but uses the mesentery of the ileum. The base of the transverse mesocolon lies horizontally across the duodenum and pancreas. The greater omentum has several parts, including the 4-layered omental apron hanging down off of the transverse colon and the 2-layered gastrocolic ligament connecting the greater curvature of the stomach and the transverse colon. Three longitudinal teniae coli are present in the cecum, ascending colon, transverse colon, descending colon, and sigmoid colon; they are not present in the rectum. In the ascending and descending colon, they are present anteriorly and on the posterolateral and posteromedial aspects. Appendages of fat, containing small blood vessels, called omental appendages (appendices epiploicae) are attached to colon. The colon is supplied by the superior mesenteric artery through its right colic and middle colic branches and by the inferior mesenteric artery through its left colic and multiple sigmoid branches. The terminal branches of these arteries entering the colonic wall are called vasa recta. A continuing series of anastomoses between the distal branch of the proximal artery and the proximal branch of the distal artery runs along the mesenteric (inner) border of the colon and is called the marginal artery of Drummond. The marginal artery allows a long length of colon to be mobilized (eg, to be taken up into the chest to replace the esophagus after esophagectomy). The arc of Riolan or the meandering mesenteric artery is a communication between the middle colic artery (or its left branch) and the left colic artery (or its ascending branch). The junction of the proximal two thirds and distal one third of the transverse colon, where the terminal branches of the superior and inferior mesenteric arteries meet, is the watershed area, which is prone to ischemia. The superior mesenteric vein accompanies the superior mesenteric artery, but the inferior mesenteric vein drains higher than the origin of the inferior mesenteric artery; it runs vertically upward to the left of the duodenojejunal junction (flexure) and enters the splenic vein or its junction with the superior mesenteric vein to form the portal vein. Lymphatics of the colon drain into the epicolic (on the surface of colon), paricolic (next to colon), intermediate (along branches of named vessels), and main or mesocolic (along the named colic vessels) lymph nodes.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/24/12724tn.jpg"
        ]
    },
    "Conduction System of the Heart": {
        "description": "The conducting system of the heart consists of cardiac muscle cells and conducting fibers (not nervous tissue) that are specialized for initiating impulses and conducting them rapidly through the heart (see the image below). They initiate the normal cardiac cycle and coordinate the contractions of cardiac chambers. Both atria contract together, as do the ventricles, but atrial contraction occurs first. The conducting system provides the heart its automatic rhythmic beat. For the heart to pump efficiently and the systemic and pulmonary circulations to operate in synchrony, the events in the cardiac cycle must be coordinated.\n [1, 2] See also Heart Anatomy, Aortic Valve Anatomy, Mitral Valve Anatomy, Pulmonic Valve Anatomy, Tricuspid Valve Anatomy, Anatomy of the Nerves of the Heart, and Anatomy of the Autonomic Nervous System.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/44/12344tn.jpg"
        ]
    },
    "Dermatomes Anatomy": {
        "description": "The surface of the skin is divided into specific areas called dermatomes, which are derived from the cells of a somite. These cells differentiate into the following 3 regions: (1) myotome, which forms some of the skeletal muscle; (2) dermatome, which forms the connective tissues, including the dermis; and (3) sclerotome, which gives rise to the vertebrae. A dermatome is an area of skin in which sensory nerves derive from a single spinal nerve root (see the following image). The spinal cord has 31 segments, each with a pair (right and left) of ventral (anterior) and dorsal (posterior) nerve roots that innervate motor and sensory function, respectively. The anterior and posterior nerve roots combine on each side to form the spinal nerves as they exit the vertebral canal through the intervertebral foramina or neuroforamina. The 31 spine segments on each side give rise to 31 spinal nerves, which are composed of 8 cervical, 12 thoracic, 5 lumbar, 5 sacral, and 1 coccygeal spinal nerve. Dermatomes exist for each of these spinal nerves, except the first cervical spinal nerve. Sensory information from a specific dermatome is transmitted by the sensory nerve fibers to the spinal nerve of a specific segment of the spinal cord. The C1-C7 nerve roots emerge above their respective vertebrae; the C8 nerve root emerges between the C7 and T1 vertebrae. The remaining nerve roots emerge below their respective vertebrae. Along the thorax and abdomen, the dermatomes are evenly spaced segments stacked up on top of each other, and each is supplied by a different spinal nerve. The dermatomes along the arms and legs differ from the pattern of the trunk dermatomes, because they run longitudinally along the limbs. The general pattern is similar in all people, but significant variations exist in dermatome maps from person to person.\n [1] Dermatomes are useful to help localize neurologic levels, particularly in radiculopathy. Effacement or encroachment of a spinal nerve may or may not exhibit symptoms in the dermatomic area covered by the compressed nerve roots in addition to weakness, or deep tendon reflex loss. Viruses that infect spinal nerves, such as herpes zoster infections (shingles), can reveal their origin by showing up as a painful dermatomic area. Herpes zoster, a virus that can be dormant in the dorsal root ganglion, migrates along the spinal nerve to affect only the area of skin served by that nerve. Dermatomes are clinically important and necessary for assessing and diagnosing the level of spinal cord injury in the American Spinal Injury Association (ASIA) Impairment scale.\n [2]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/03/11503tn.jpg"
        ]
    },
    "Ductus Deferens (Vas Deferens) and Ejaculatory Duct Anatomy": {
        "description": "Once sperm cells are produced in the testis and accumulate in the epididymis, they rely on the ductus (vas) deferens and ejaculatory duct to propel them into the urethra and out of the penis during ejaculation. The ejaculatory duct delivers sperm into the urethra, adding secretions and additives from the prostate necessary for sperm function, while providing an interface between the reproductive and urinary systems in men (see image below).",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/51/12751tn.jpg"
        ]
    },
    "Duodenal Anatomy": {
        "description": "The duodenum is the first part of the small intestine (5-7 m), followed by the jejunum and ileum (in that order); it is also the widest and shortest (25 cm) part of the small intestine. The duodenum is a C-shaped or horseshoe-shaped structure that lies in the upper abdomen near the midline (see the image below).\n [1, 2]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/29/12029tn.jpg"
        ]
    },
    "Ear Anatomy": {
        "description": "The anatomy of the ear is composed of the following parts\n [1, 2, 3, 4] : External ear (auricle) (see the following image) Middle ear (tympanic): Malleus, incus, and stapes (see the image below) Inner ear (labyrinthine): Semicircular canals, vestibule, cochlea (see the image below) The ear is a multifaceted organ that connects the central nervous system to the external head and neck. This structure as a whole can be thought of as 3 separate organs that work in a collective to coordinate certain functions, such as hearing and balance. Any disharmony in this continuum may disrupt the ear's functionality.\n [1, 2, 3, 5]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/85/12685tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/86/12686tn.jpg"
        ]
    },
    "Elbow Joint Anatomy": {
        "description": "The human elbow is the summation of 3 articulations. The first 2 are the ones traditionally thought of as constituting the elbow: the humeroulnar articulation (the synovial hinge joint with articulation between the trochlea of the humeral condyle and the trochlear notch of the ulna) and the humeroradial articulation (the articulation between the capitulum of the humeral condyle and the concavity on the superior aspect of the head of the radius). The third is a pivot-type synovial joint with articulation between the head of the radius and the radial notch of the ulna.\n [1] These 3 articulations, forming 2 different aspects, allow flexion and extension of the elbow, as well as supination and pronation of the forearm and wrist at the elbow. When the elbow is in anatomic position, the long axis of the forearm typically has an offset (lateral inclination or valgus at the elbow) of about 19 º from the long axis of the humerus.\n [2] This angle shows no difference between genders but does increase slightly with age into adulthood.\n [3]",
        "image_urls": []
    },
    "Endocrine System Anatomy": {
        "description": "The endocrine system—the other communication system in the body—is made up of endocrine glands that produce hormones, chemical substances released into the bloodstream to guide processes such as metabolism, growth, and sexual development. Hormones are also involved in regulating emotional life. The thyroid gland secretes thyroxin, a hormone that can reduce concentration and lead to irritability when the thyroid is overactive and cause drowsiness and a sluggish metabolism when the thyroid is underactive. Near the thyroid are 4 tiny pea-shaped organs, the parathyroids, which secrete parathormone to control and balance the levels of calcium and phosphate in the blood and tissue fluids. This, in turn, affects the excitability of the nervous system. The pineal gland is a pea-sized gland that apparently responds to exposure to light and regulates activity levels over the course of the day. The pancreas lies in the curve of the duodenum and controls the level of sugar in the blood by secreting insulin and glucagon. The pituitary gland produces the largest number of different hormones and, therefore, has the widest range of effects on the body's functions. The posterior pituitary is controlled by the nervous system. It produces 2 hormones: vasopressin, which causes blood pressure to rise and regulates the amount of water in the body's cells, and oxytocin, which causes the uterus to contract during childbirth and lactation to begin. The anterior pituitary, often called the \"master gland,\" responds to chemical messages from the bloodstream to produce numerous hormones that trigger the action of other endocrine glands. These reproductive glands—the testes in males and the ovaries in females, and, to a lesser extent, the suprarenal (adrenal) glands —secrete androgens (including testosterone) and estrogens. The 2 suprarenal glands are located above the kidneys. Each has 2 parts: an outer covering, the adrenal cortex, and an inner core, the adrenal medulla. Both influence the body's responses to stress. For example, in response to a stressful situation, the pituitary gland may release beta endorphin and ACTH, which, in turn, prompt the suprarenal cortex to release hormones. Meanwhile, the autonomic nervous system stimulates the suprarenal medulla to secrete hormones such as epinephrine into the bloodstream. See the image below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/34/12634tn.jpg"
        ]
    },
    "Esophagus Anatomy": {
        "description": "The esophagus is a 25-cm long muscular tube that connects the pharynx to the stomach.\n [1] The length of the esophagus at birth varies between 8 and 10 cm and measures about 19 cm at age 15 years.\n [2] The esophagus extends from the lower border of the cricoid cartilage (at the level of the sixth cervical vertebra) to the cardiac orifice of the stomach at the side of the body of the 11th thoracic vertebra. The upper limit in the newborn infant is found at the level of the fourth or fifth cervical vertebra, and it ends higher, at the level of the ninth thoracic vertebra.\n [2, 3] In its vertical course, the esophagus has 2 gentle curves in the coronal plane. The first curve begins a little below the commencement of the esophagus and inclines to the left as far as the root of the neck and returns to the midline at the level of fifth thoracic vertebra. The second curve to the left is formed as the esophagus bends to cross the descending thoracic aorta, before it pierces the diaphragm. The esophagus also has anteroposterior curvatures that correspond to the curvatures of the cervical and thoracic part of the vertebral column.\n [1, 2] The video below depicts the esophagus as viewed through an esophagoscope in a 3-year-old child. The videos below depict other views of normal esophageal anatomy via endoscopy. The video below depicts normal esophageal anatomy via esophagogastroduodenoscopy. The esophagus has 3 constrictions in its vertical course, as follows: The first constriction is at 15 cm from the upper incisor teeth, where the esophagus commences at the cricopharyngeal sphincter; this is the narrowest portion of the esophagus and approximately corresponds to the sixth cervical vertebra The second constriction is at 23 cm from the upper incisor teeth, where it is crossed by the aortic arch and left main bronchus The third constriction is at 40 cm from the upper incisor teeth, where it pierces the diaphragm; the lower esophageal sphincter (LES) is situated at this level\n [1, 2, 3] These measurements are clinically important for endoscopy and endoscopic surgeries of the esophagus. The esophagus has been subdivided into 3 portions, as follows: The cervical portion extends from the cricopharyngeus to the suprasternal notch The thoracic portion extends from the suprasternal notch to the diaphragm The abdominal portion extends from the diaphragm to the cardiac portion of the stomach.\n [3] The relationships of the cervical esophagus, thoracic esophagus, and abdominal esophagus are described below.\n [1, 2] The cervical part of the esophagus The trachea lies anterior to the esophagus and is connected to it by a loose connective tissue. Posteriorly, it is related to prevertebral muscles and prevertebral fascia covering the bodies of sixth and seventh cervical vertebra. The thoracic duct lies on the left side at the level of the sixth cervical vertebra. The carotid sheath with its contents and lower poles of the lateral lobes of thyroid gland are in lateral relation to the esophagus on both the sides. The thoracic part of the esophagus The esophagus lies between the trachea and vertebral column in the superior mediastinum. On its way down, the esophagus passes behind the aortic arch, and, at the level of T4/T5 intervertebral discs, it enters the posterior mediastinum. The thoracic duct lies on the left side, and the left recurrent laryngeal nerve lies in the left tracheoesophageal groove. Laterally, on the left side, it is related to the aorta and left subclavian artery; on the right side, it is related to the azygos vein. Anteriorly, the esophagus is related to the trachea, right pulmonary artery, left bronchus, pericardium with left atrium, and diaphragm. Posteriorly, the esophagus is related to the vertebral column, right posterior intercostal arteries, thoracic duct, thoracic part of the aorta, and diaphragm. In the posterior mediastinum, the esophagus is related to the descending thoracic aorta, left mediastinal pleura, azygos vein, and cardiac and pulmonary plexus. The abdominal part of the esophagus The esophagus passes through the right crus of the diaphragm. In its abdominal course, it is covered with the peritoneum of the greater sac anteriorly and on its left side, and it is covered with the lesser sac peritoneum on the right side. It comes to lie in the esophageal groove on the posterior surface of the left lobe of the liver and curves sharply to the left to join the stomach at the cardia. The right border continues evenly into the lesser curvature, whereas the left border is separated from the fundus of the stomach by the cardiac notch.\n [2] See the list below: The cervical portion is supplied by the inferior thyroid artery The thoracic portion is supplied by bronchial and esophageal branches of the thoracic aorta The abdominal portion is supplied by ascending branches of the left phrenic and left gastric arteries.\n [1] Venous blood from the esophagus drains into a submucosal plexus. From this plexus, blood drains to the periesophageal venous plexus. Esophageal veins arise from this plexus and drain in a segmental way similar to the arterial supply, as follows: From the cervical esophagus, veins drain into the inferior thyroid vein From the thoracic esophagus, veins drain into the azygos veins, hemiazygos, intercostal, and bronchial veins From the abdominal portion, esophagus veins drain into the left gastric vein; the left gastric vein is a tributary of the portal system.\n [1, 2] The esophagus has an extensive, longitudinally continuous, submucosal lymphatic system.\n [2] The esophagus has 2 types of lymphatic vessels. A plexus of large vessels is present in the mucous membrane, and it is continuous above with the mucosal lymphatic vessels of pharynx and below with mucosal lymphatic vessels of gastric mucosa. The second plexus of finer vessels is situated in the muscular coat. Efferent vessels from the cervical part drain into the deep cervical nodes. Vessels from the thoracic part drain to the posterior mediastinal nodes and from the abdominal part drain to the left gastric nodes. Some vessels may pass directly to the thoracic duct.\n [1, 2] Lymphatic drainage of the esophagus contains little barrier to spread, and esophageal lymphatics are densely interconnected. Hence, esophagus carcinoma can spread through the length of the esophagus via lymphatics and may have nodal involvement several centimeters away from the primary lesion.\n [3] Recurrent laryngeal branches of the vagus nerve supply the striated muscle in the upper third of the esophagus, and cell bodies for these fibers are situated in the rostral part of the nucleus ambiguus. Motor supply to the nonstriated muscle is parasympathetic, and cell bodies for these fibers are situated in the dorsal nucleus of vagus. These fibers reach the esophagus through the vagus and its recurrent laryngeal branches. They synapse in the esophagus wall in the ganglia of submucosal plexus (Meissner) and myenteric plexus (Auerbach). The myenteric is situated between the outer longitudinal and inner circular muscle fibers. From these plexuses, short, postganglionic fibers emerge to innervate the mucous glands and smooth muscle fibers within the walls of the esophagus.\n [2] Vasomotor sympathetic fibers that supply the esophagus arise from the upper 4-6 thoracic spinal cord segments. Fibers from the upper ganglia pass to the middle and inferior cervical ganglia and synapse on postganglionic neurons. The axons of these neurons innervate the vessels of the cervical and upper thoracic esophagus. Postsynaptic fibers from the lower ganglia pass to the esophageal plexus to innervate the distal esophagus. Afferent visceral pain fibers travel via the sympathetic fibers to the first 4 segments of the thoracic spinal cord.\n [1]",
        "image_urls": []
    },
    "Extraocular Muscle Actions": {
        "description": "Ductions are monocular eye movements. Movement of the eye nasally is adduction; temporal movement is abduction. Elevation and depression of the eye are termed sursumduction (supraduction) and deorsumduction (infraduction), respectively. Incycloduction (intorsion) is nasal rotation of the vertical meridian; excycloduction (extorsion) is temporal rotation of the vertical meridian. (See the image below.) The primary muscle that moves an eye in a given direction is known as the agonist. A muscle in the same eye that moves the eye in the same direction as the agonist is known as the synergist, while a muscle in the same eye that moves the eye in the opposite direction of the agonist is the antagonist. For example, in abduction of the right eye, the right lateral rectus muscle is the agonist; the right superior and inferior oblique muscles are the synergists; and the right medial, superior, and inferior recti are the antagonists. By the Sherrington law, increased innervation to any muscle (agonist) is accompanied by a corresponding decrease in innervation to its antagonists.\n [1, 2] Binocular eye movements are either conjugate (versions) or disconjugate (vergences).\n [3] Versions are movements of both eyes in the same direction (eg, right gaze in which both eyes move to the right). Dextroversion is movement of both eyes to the right, and levoversion is movement of both eyes to the left. Sursumversion (supraversion) and deorsumversion (infraversion) are elevation and depression of both eyes, respectively. Yoke muscles are the primary muscles in each eye that accomplish a given version (eg, for right gaze, the right lateral rectus and left medial rectus muscles). Each extraocular muscle has a yoke muscle in the opposite eye to accomplish versions into each gaze position. By the Herring law, yoke muscles receive equal and simultaneous innervation. The magnitude of innervation is determined by the fixating eye, which means that the angle of deviation between eyes (strabismus) may vary depending on which eye is fixating. The primary deviation is misalignment, with the normal eye fixating. If the paretic eye fixates, the ensuing secondary deviation is typically larger than the primary deviation. As opposed to versions (in which both eyes move in the same direction), vergences are movements of the eyes in opposite directions. Convergence is movement of both eyes nasally, and divergence is movement of both eyes temporally. Vertical vergence movements may also occur (ie, one eye moving upward or the other eye moving downward relative to the contralateral eye). Accommodative convergence is convergence of the eyes stimulated by accommodating or focusing on a near target. Abnormality of the accommodative convergence to accommodation ratio may cause certain types of strabismus.\n [4, 5, 6] Fusional convergence and divergence are optomotor reflexes that are designed to position the eyes such that the image of regard falls on the fovea of each eye. This motor fusion is important to avoid diplopia (double vision). The field of action of an extraocular muscle is the direction of rotation of the eye when that muscle contracts. This term also indicates the gaze position in which the effects of a muscle most easily are demonstrated. Knowledge of fields of action is important; strabismus often increases in the field of action of a weak eye muscle. For patient education information, see the Eye and Vision Center, as well as Anatomy of the Eye.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/07/7207tn.jpg"
        ]
    },
    "Extraocular Muscle Anatomy": {
        "description": "Extraocular muscles differ histologically from most other skeletal muscles in that they are made up of 2 different types of muscle cells. Each muscle cell is composed of groups of myofibrils called sarcomeres. Fibrillenstruktur (or fast-twitch) muscle fibrils generate fast eye movements and are composed of well-defined myofibrils with well-developed sarcomeres. Felderstruktur muscle fibrils generate slow or tonic eye movements and are composed of poorly defined myofibrils with poorly developed sarcomeres.\n [1, 2, 3] Cholinergic motor neurons supply both types of muscle fibers. The innervation to fibrillenstruktur fibrils is thick and heavily myelinated, with a single (en plaque) neuromuscular junction, whereas the innervation to felderstruktur fibrils is thin, with multiple grapelike clusters of neuromuscular junctions.",
        "image_urls": []
    },
    "Eye Globe Anatomy": {
        "description": "For the purpose of this article on eye globe anatomy, the eye will be divided into 2 sections: extraocular (ie, structures outside of the globe) and the ocular (ie, the globe and intraocular structures). Throughout the years, in the absence of ancillary or diagnostic tools, many descriptive phrases, clichés, or analogies have been used to describe the eye, such as \"the eye is the window to the soul,\" the \"eye works like a camera,\" and \"the eye is the only structure that allows us to physically see blood vessels and nerve fibers.\" We use our eyes daily and in almost every activity we perform (eg, reading, driving, watching). At the foundation, the eye is a sensory organ that detects specifically photons. Photons within the visible spectrum (ie, light) enters the eye first by passing through the cornea, a clear, dome-shaped structure at the anterior post portion of the globe. Light passing through the cornea is converged (bent) where it passes through the anterior chamber and the pupil, a circular opening regulating the amount of light entering the eye. Light is further converged by the crystalline lens located posterior to the iris. Light continues through the vitreous humor and the light converges on the retina, specifically the fovea centralis of the macula. Within the layers of the retina, photons trigger a series of electrical and chemical reactions, ultimately sending electrical signals by way of the optic nerve, along with visual pathway to the occipital cortex. Within the occipital cortices, these electrical signals are processed and interpreted, (ie, \"seen\") by the brain as a visual image.\n [1] The image below depicts a sagittal section of the eye.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/49/12349tn.jpg"
        ]
    },
    "Eyelid Anatomy": {
        "description": "The eyelids act to protect the anterior surface of the globe from local injury. Additionally, they aid in regulation of light reaching the eye; in tear film maintenance, by distributing the protective and optically important tear film over the cornea during blinking; and in tear flow, by their pumping action on the conjunctival sac and lacrimal sac. Structures that must be considered in a description of lid anatomy are the skin and subcutaneous tissue; the orbicularis oculi muscle (shown below); the submuscular areolar tissue; the fibrous layer, consisting of the tarsi and the orbital septum; the lid retractors of the upper and lower eyelids; the retroseptal fat pads; and the conjunctiva. The anatomy of the lid is best approached initially by reviewing a sagittal cross section of the eyelid. The exact number of tissue layers and the relationship between the many layers are modified significantly by the level of the lid examined. The orbital septum represents the anatomic boundary between the lid tissue and the orbital tissue, but an assessment of eyelid function and preparation for lid surgery requires knowledge of these postseptal structures. The upper and lower lids may be considered analogous structures, with differences mainly in the lid retractor arrangement.\n [1] In eyelid reconstruction, it is more practical to consider the repair of the anterior and posterior lamellae, with the anterior lamella being the skin and orbicularis, and the posterior lamella being the tarsus and conjunctiva. For patient education information, see the Eye and Vision Center, as well as Anatomy of the Eye.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/51/24451tn.jpg"
        ]
    },
    "Facelift Anatomy": {
        "description": "With age, characteristic changes occur in the central third of the face.\n [1] A youthful midface is characterized by prominent cheeks and a smooth transition between the lower eyelid and cheek. Structural, soft tissue, and skin changes develop as wrinkles and creases, progressive ptosis, and general atrophy of the structures. Pessa confirmed the changes seen in the bony structures of the face, and these include a downward migration of cephalometric points.\n [2] The downward migration manifests as a change in soft tissue volume. The effects of gravity and repeated animation of the face also directly affect the soft tissue that overlies the mimetic musculature. The results of magnetic resonance imaging (MRI) evaluations have helped to determine that the mimetic muscles themselves remain intact; however, the attachment to the overlying soft tissue and skin changes. The repeated action of smiling results in deepening of the nasolabial fold at the point at which the superficial musculoaponeurotic system (SMAS) inserts into the dermis.",
        "image_urls": []
    },
    "Facial Anatomy in Cutaneous Surgery": {
        "description": "Skin tension lines (STLs) are the result of a complex interaction between internal and external factors involving the skin. The intrinsic framework, which consists of elastin and collagen, progressively loosens with age. Its interaction with the muscles of facial expression leads to the development of STLs. Generally, STLs are perpendicular to the underlying muscles of the face. Aging, particularly photoaging, tends to accentuate the appearance of STLs. (See the image below.) In the repair of STLs, the correct placement of the long axis of an excision parallel to the STLs results in better scar cosmesis. Furthermore, flaps should be placed to allow the suture lines to fall in STLs. Although STLs may vary between individuals, some areas of the face have greater variability than others. Typically, the forehead, which has 1 major muscle group that pulls it vertically, has little individual variability; nearly everyone has horizontal STLs. In comparison, anatomic areas where multiple muscles act in different directions are likely to have greater variability. In elderly patients, the direction of the relaxed STLs is generally obvious. In areas of ambiguity, excising the lesion as a circle and undermining it invariably pulls the surgical defect into an oval, with the long axis corresponding to the relaxed STL.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/36/6536tn.jpg"
        ]
    },
    "Facial Bone Anatomy": {
        "description": "The facial skeleton serves to protect the brain; house and protect the sense organs of smell, sight, and taste; and provide a frame on which the soft tissues of the face can act to facilitate eating, facial expression, breathing, and speech. The primary bones of the face are the mandible, maxilla, frontal bone, nasal bones, and zygoma. Facial bone anatomy is complex, yet elegant, in its suitability to serve a multitude of functions. The image below provides an overview of the anterior features of the skull.\n [1, 2, 3, 4, 5, 6]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/15/306015tn.jpg"
        ]
    },
    "Facial Nerve Anatomy": {
        "description": "The facial nerve, or cranial nerve (CN) VII, is the nerve of facial expression. The pathways of the facial nerve are variable, and knowledge of the key intratemporal and extratemporal landmarks is essential for accurate physical diagnosis and safe and effective surgical intervention in the head and neck. (See the image below.) The facial nerve is composed of approximately 10,000 neurons, 7,000 of which are myelinated and innervate the nerves of facial expression. Three thousand of the nerve fibers are somatosensory and secretomotor and make up the nervus intermedius. The course of the facial nerve and its central connections can be roughly divided into the segments listed in Table 1, below. Table 1. Segmental Description of the Facial Nerve and Central Connections (Open Table in a new window) Segment Location Length, mm Supranuclear Cerebral cortex NA Brainstem Motor nucleus of facial nerve, superior salivatory nucleus of tractus solitarius NA Meatal segment Brainstem to internal acoustic meatus or canal (IAC) 13-15 Labyrinthine segment Fundus of IAC to facial hiatus 3-4 Tympanic segment Geniculate ganglion to pyramidal eminence 8-11 Mastoid segment Pyramidal eminence to stylomastoid foramen 10-14 Extratemporal segment Stylomastoid foramen to pes anserinus 15-20 The objective of this article is to briefly review the anatomy of the facial nerve in each of these segments and to follow the nerve from its most proximal origin to its end organ; ie, the muscles of facial expression. [NA = Not applicable]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/74/24474tn.jpg"
        ]
    },
    "Facial Nerve Embryology": {
        "description": "In order to appreciate the complex embryology of the facial nerve, one has to have a basic understanding of cranial embryology as a whole. Although it may seem daunting to the casual reader, revisiting cranial embryology allows for a more comprehensive understanding of the final 3-dimensional structure of the nerve, as well as the inherent logic in its development. To this end, this article briefly discusses numerous important processes in head and neck embryology, namely the implications of patterning in hindbrain development, the diverse roles of neural crest cells, migration of the neural crest cells into the branchial arches (particularly the hyoid arch), and the genetic control of these processes. This may help prepare the otolaryngologist to comprehend and anticipate variations encountered in clinical practice, such as anticipating facial nerve anomalies in congenital stapes fixation.\n [1]  However, the main objective of this article is to outline the embryology of the facial nerve and its common clinical implications. The reader is referred to Embryology and Anomalies of the Facial Nerve and Their Surgical Implications, 2nd Ed for a more comprehensive review of the development of the facial nerve and the associated development of the ear (see table 1).\n [14]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/15/24615tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/16/24616tn.jpg"
        ]
    },
    "Female Reproductive Organ Anatomy": {
        "description": "The female reproductive system is a complicated but fascinating subject. It has the capability to function intimately with nearly every other body system for the purpose of reproduction. The female reproductive organs can be subdivided into the internal and external genitalia (see the images below). The internal genitalia are those organs that are within the true pelvis. These include the vagina, uterus, cervix, uterine tubes (oviducts or fallopian tubes), and ovaries. The external genitalia lie outside the true pelvis. These include the perineum, mons pubis, clitoris, urethral (urinary) meatus, labia majora and minora, vestibule, greater vestibular (Bartholin) glands, Skene glands, and periurethral area.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/32/12032tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/33/12033tn.jpg"
        ]
    },
    "Female Urethra Anatomy": {
        "description": "The female urethra is a relatively simple tubular structure that has the sole purpose of conducting urine from the bladder to the outside of the body. It is a short structure without complex investing structures; thus, it is less prone to intrinsic pathology than the male urethra is. Nevertheless, understanding the anatomy of the female urethra and its relations is critical in understanding the common clinical problems of stress urinary incontinence and urinary tract infection.",
        "image_urls": []
    },
    "Female Urinary Organ Anatomy": {
        "description": "The female pelvis is accustomed to a wide range of natural and pathologic conditions that a woman may experience in her life. The uterus significantly enlarges during pregnancy. The ovaries can be subject to various natural and pathologic states ranging from benign cysts to advanced ovarian carcinoma. From the gross anatomy of the female pelvis to the microscopic anatomy, form follows function and allows for reproductive processes as well the possibility for pathologic conditions. The anatomy of the female genitourinary organs (see the image below) is addressed in the following section, along with certain anatomic variants.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/39/12039tn.jpg"
        ]
    },
    "Femoral Sheath and Inguinal Canal Anatomy": {
        "description": "The inguinofemoral region is a relatively complex one that is significant for clinicians across various fields. Recognition of normal and pathologic variation within this region is important to many surgical disciplines, including general, vascular, plastic, oncologic, gynecologic, and urologic surgery. Medical intensivists, cardiologists, general physicians, and pediatricians also require a working understanding of the femoral sheath and inguinal canal. Inguinofemoral anatomy has been well described in detail;\n [1]  the focus of this article is on anatomic considerations relevant to the clinical diagnosis and care of patients, with particular emphasis on procedural and urgent medicine.",
        "image_urls": []
    },
    "Flexor Tendon Anatomy": {
        "description": "The flexor tendon system of the hand consists of the flexor muscles of the forearm, their tendinous extensions, and the specialized digital flexor sheaths. These components work in concert to produce smooth and efficient flexion of the individual digits of the hand. Injury to the flexor tendon system can lead to significant morbidity for patients.\n [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13] In addition to having technical expertise, experienced hand surgeons must have precise knowledge of flexor tendon anatomy to guide appropriate treatment of injuries to the flexor tendon system. (See the images below.)\n [14, 15, 16, 17, 18, 19, 20]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/47/7547tn.jpg"
        ]
    },
    "Foot Bone Anatomy": {
        "description": "The human foot is a highly developed, biomechanically complex structure that serves to bear the weight of the body as well as forces many times the weight of the human body during propulsion. About 26 bones in the human foot provide structural support. They can be grouped into 3 parts, as follows\n [1, 2] : The tarsal bones (7)\n [3, 4] The metatarsal bones (5)\n [5] The phalanges (14)\n [6] Apart from these main bones, the sesamoid bones help improve function and are often found as variants of the accessory bones. The foot itself can be divided into 3 parts: the hindfoot, the midfoot, and the forefoot. The hindfoot is composed of 2 of the 7 tarsal bones, the talus, and the calcaneus; the midfoot contains the rest of the tarsal bones; and the forefoot contains the metatarsals and the phalanges. The images below depict the bones of the foot.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/21/12321tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/22/12322tn.jpg"
        ]
    },
    "Forehead Anatomy": {
        "description": "The forehead constitutes the upper third of the face. It is delineated superiorly by the hairline and inferiorly by the glabella and frontonasal groove (centrally) and the eyebrows overlying the supraorbital ridges (laterally.) The hairline is not a stable landmark among individuals; factors of sex, age, familial characteristics, and the influences of culture and fashion decide the hairline position for individuals. Surgery in the upper third of the face, whether reconstructive or cosmetic, can be considered to involve at least 1 of 3 regions: the central forehead, the hair-bearing scalp, and the temporal regions. Anatomy must be reviewed in the context of the eyebrow-forehead-temple continuum. Although the hairline defines the anatomic boundary between the forehead and the scalp, consideration must be given to anticipated patterns of baldness in the future, because scars may be exposed with a receding hairline. The density of eyebrow hair generally remains stable with age, although it may frequently be altered in appearance by plucking or tattooing. Eyebrow position, contour, and movement are important features of facial expression. The medial eyebrow hairs are almost vertical in orientation, while laterally they become more horizontal. The eyebrow forms an arc laterally, with the peak at the junction of the medial two thirds and the lateral third. The brow is straighter and thicker in males, being at the level of the superior orbital rim; it is more arched, thinner, and higher in females. The superior orbital margin forms a well-marked prominence that may be palpated along its length. It frequently presents the supraorbital notch, which can be felt at the junction of the medial third and lateral two thirds. The Latin root of the word glabella means hairless and smooth, and the glabella is such in youth; however, glabellar transverse and vertical rhytides are common with age. Superiorly, between the eyebrows and the hairline, smoothness gives way to horizontal forehead rhytides with age. Rhytides may be considered to give an opportunity for scar camouflage in surgery. The curved arc of the temporal line is palpable at the lateral limits of the forehead and is made more apparent with the action of the temporalis muscle with mastication. The superficial temporal artery is generally palpable in the temple, which is important in the consideration of a temporal artery biopsy and when local vascularized flaps are planned. The lateral orbital margin is visible and palpable in its extent, and the frontozygomatic suture frequently may be felt as a small depression some 10 mm superior to the lateral canthus. The superior margin of the zygomatic arch is generally palpable, extending between the lateral orbital rim and the anterior border of the tragus. The course of the frontal branch of the facial nerve passes through the temple and forehead, placing this nerve at risk of injury at the time of surgical dissection. The usual trajectory of the nerve is from a point 5 mm below the tragus to a point 15 mm above the lateral extremity of the brow. Over the zygomatic arch, it is situated halfway between the lateral canthus and the inferior helix. This places it about 2.5 cm lateral to the lateral canthus.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/18/61618tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/19/61619tn.jpg"
        ]
    },
    "Gallbladder Anatomy": {
        "description": "The gallbladder (see the images below) is a relatively small but surgically important organ of the body. Cholecystectomy (open or laparoscopic surgical removal of the gallbladder as a treatment for stones) is one of the most common surgical procedures performed the world over.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/77/12177tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/78/12178tn.jpg"
        ]
    },
    "Hair Anatomy": {
        "description": "The human hair follicle is an intriguing structure, and much remains to be learned about hair anatomy and its growth. The hair follicle can be divided into 3 regions: the lower segment (bulb and suprabulb), the middle segment (isthmus), and the upper segment (infundibulum). The lower segment extends from the base of the follicle to the insertion of the erector pili muscle (also known as the arrector pili muscle). The middle segment is a short section that extends from the insertion of the erector pili muscle to the entrance of the sebaceous gland duct. The upper segment extends from the entrance of the sebaceous gland duct to the follicular orifice. (See the image below.)\n [1, 2] The histologic features of the hair follicle change continuously and considerably during the hair growth cycle, thereby making follicular anatomy an even more complex entity. The size of hair follicles varies considerably during the existence of the follicles. Anagen hairs vary in size from large terminal hairs, such as those on the scalp, to the small vellus hairs that cover almost the entire glabrous skin (except palms and soles). Under hormonal influences, the vellus hair follicles in the male beard area usually thicken and darken at puberty. In predisposed individuals, the terminal hairs on the adult scalp can undergo involutional miniaturization (become vellus). Although vellus hairs greatly outnumber terminal hairs, the latter are more important. Therefore, the discussion of hair anatomy in this article focuses on terminal hairs. The follicular life cycle can be divided into 3 phases: anagen, catagen, and telogen. The anagen phase is the phase of active growth, the catagen phase marks follicular regression, and the telogen phase represents a resting period. In the human scalp, the anagen phase lasts approximately 3-4 years, while the catagen phase lasts about 2-3 weeks, and the telogen phase lasts approximately 3 months. Approximately 84% of scalp hairs are in the anagen phase, 1-2% are in the catagen phase, and 10-15% are in the telogen phase. Techniques for studying hair microanatomy include the following: Hair clipping - Performed close to the surface of the scalp Gentle hair pull Aggressive hair pluck (trichogram) Scalp biopsy - Possible use of light microscopy or scanning electron microscopy to study scalp tissue",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/88/24488tn.jpg"
        ]
    },
    "Hand Anatomy": {
        "description": "The anatomy of the hand is complex, intricate, and fascinating. Its integrity is absolutely essential for our everyday functional living. Our hands may be affected by many disorders, most commonly traumatic injury. For any physician or therapist treating hand problems, the mastery of such anatomy is fundamental in order to provide the best quality of care. (See the image below.)\n [1, 2, 3, 4, 5, 6, 7] A total of 27 bones constitute the basic skeleton of the wrist and hand. The hand is innervated by 3 nerves — the median, ulnar, and radial nerves — each of which has sensory and motor components. The muscles of the hand are divided into intrinsic and extrinsic groups.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/67/8267tn.jpg"
        ]
    },
    "Heart Anatomy": {
        "description": "Intraoperatively, the anatomy of the heart is viewed from the right side of the supine patient via a median sternotomy incision. The structures initially seen from this perspective include the superior vena cava, right atrium, right ventricle, pulmonary artery, and aorta. Medial displacement of the right side of the heart exposes the left atrium and right pulmonary veins. Medial rotation from the left exposes the left ventricle apex, left pulmonary veins, and left atrium. (See the images below.) The overall shape and position of the heart may vary according to the relative size and orientation of each of its parts. For example, a large right ventricle may allow exposure of only a short segment of aorta; this is because of the narrow confines of the middle mediastinal space.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/07/25207tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/08/25208tn.jpg"
        ]
    },
    "Heart Nerve Anatomy": {
        "description": "The heart is innervated by parasympathetic and sympathetic fibers. The medulla is the primary site in the brain for regulating sympathetic and parasympathetic outflow to the heart and blood vessels. The hypothalamus and higher centers modify the activity of the medullary centers and are particularly important in regulating cardiovascular responses to emotion and stress (eg, exercise, thermal stress). The vagus nerve has 3 nuclei in the central nervous system (CNS) associated with cardiovascular control: (1) the dorsal motor nucleus, (2) the nucleus ambiguus, and (3) the solitary nucleus. The parasympathetic output to the heart comes mainly from neurons in the nucleus ambiguus and to a lesser extent from the dorsal motor nucleus (see the image below).\n [1] The solitary nucleus, being an integrating hub for the baroreflex, receives sensory input about the state of the cardiovascular system. The afferent fibers of the autonomic nervous system of the heart share the same pathway with gastrointestinal, genitourinary, baroreceptors, and chemoreceptors and transmit signals to the medulla by cranial nerves X and IX. The nucleus tractus solitarius (NTS) of the medulla receives sensory input from baroreceptors and chemoreceptors (see the image above). Autonomic outflow from the medulla is divided principally into sympathetic and parasympathetic branches (see the image below). All the fibers forming the different cardiac plexus present synapse with the cervical plexus, brachial plexus, and intercostal nerves through communicating branches. These synapses have a great importance in the presence of pain in certain cardiac pathologies.\n [1] See also Heart Anatomy, Aortic Valve Anatomy, Mitral Valve Anatomy, Pulmonic Valve Anatomy, and Tricuspid Valve Anatomy.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/76/12376tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/77/12377tn.jpg"
        ]
    },
    "Hip Joint Anatomy": {
        "description": "The hip joint (see the image below) is a ball-and-socket synovial joint: the ball is the femoral head, and the socket is the acetabulum. The hip joint is the articulation of the pelvis with the femur, which connects the axial skeleton with the lower extremity. The adult os coxae, or hip bone, is formed by the fusion of the ilium, the ischium, and the pubis, which occurs by the end of the teenage years. The 2 hip bones form the bony pelvis, along with the sacrum and the coccyx, and are united anteriorly by the pubic symphysis.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/42/12042tn.jpg"
        ]
    },
    "Hypothalamus Anatomy": {
        "description": "The hypothalamus is a region of the brain composed of many small nuclei with diverse functions. Located above the midbrain and below the thalamus, the hypothalamus makes up the ventral diencephalon. The diencephalon is an embryologic region of the vertebrate neural tube that gives rise to posterior forebrain structures. By synthesizing and secreting neurohormones, the nuclei of the hypothalamus act as a conduit between the nervous and endocrine systems via the pituitary gland (hypophysis), regulating homeostatic functions such as hunger, thirst, body temperature, and circadian rhythms.\n [1]",
        "image_urls": []
    },
    "Immune System Anatomy": {
        "description": "The immune system is an inherent self-defense system consisting of cells that helps the body distinguish between self and non-self molecules. Different pathways regulate different immune cells to help the body differentiate the bodies own healthy cells from disease-causing agents including bacteria, viruses, fungi, parasites, cancerous cells, and many more. All the components of the immune system have to continuously modify to keep the bodies defense up against the ever-evolving organisms that constantly are on a quest to find a new way to attack the host. This continuously evolving system sometimes reacts against the bodies own cells, identifying it as foreign, which leads to healthy tissue destruction and causes autoimmune diseases and cancers. Also, weakened defenses of the body by the immune system due to genetic, acquired causes precipitate an inherent state of anergy (unresponsiveness) that can lead to immunodeficiency diseases. The immune system consists of multiple levels of defense against invading pathogens. It consists of physical barriers, mechanisms of innate immunity as well as adaptive immunity. The physical barrier can be mechanical, chemical, or biological and located at different sites in the body including skin, secretions within the respiratory tract, and in the gastrointestinal or genitourinary tract as flora. The cells that have the inherent property of innate and adaptive immunity within the body are present at different sites including the blood, lymphatic system (lymph, lymphoid nodules and lymphoid organs), epithelium, and connective tissues.\n [1] An image depicting immunoglobulin can be seen below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/35/12635tn.jpg"
        ]
    },
    "Inguinal Region Anatomy": {
        "description": "The inguinal region of the body, also known as the groin, is located on the lower portion of the anterior abdominal wall, with the thigh inferiorly, the pubic tubercle medially, and the anterior superior iliac spine (ASIS) superolaterally. The inguinal canal is a tubular structure that runs inferomedially and contains the spermatic cord in males and the round ligament in females. The floor of the inguinal canal is the inguinal ligament, otherwise known as the Poupart ligament, which is formed by the external oblique aponeurosis as it folds over and inserts at the ASIS down to the pubic tubercle. This folded edge is called the shelving edge and is important for surgeons in hernia repairs. The inguinal canal is a conduit where structures pass, which has significance from an embryological and pathological standpoint. Formation of the inguinal canal in males occurs concurrently with testicular descent prior to birth. The testes originate in the posterior abdominal cavity and, through certain signals, descend and ultimately reside in the scrotal cavity. This descent of the testis in males creates an inherent weakness in the abdominal wall at the inguinal canal. This weakness is important in the development of inguinal hernias. During normal testicular descent, the testis migrates caudally and traverses through various layers of the abdominal wall to end up in the scrotum. In females, the final event results in the ovum descending into the pelvis. This process of testicular decent is assisted by a structure known as the gubernaculum, which forms on the inferior aspect of the gonad and signals descent and ultimately adherence of the gonad in its final destination. Failure for this event to occur in males leads to an undescended testis (testicle), otherwise known as cryptorchidism. The muscle and fascial layers of the anterior abdominal wall continue inferiorly to form the layers covering the spermatic cord as it continues through the inguinal canal and into the scrotum. Around the 12th week of gestation, the processus vaginalis forms, which is an embryonic developmental outpouching of the peritoneum.\n [1] Ultimately, the connection of the processus vaginalis with the peritoneal cavity obliterates and it becomes a serous sac surrounding the testis, called the tunica vaginalis testis.",
        "image_urls": []
    },
    "Inner Ear Anatomy": {
        "description": "In mammals, the anatomy of the inner ear consists of the bony labyrinth, a system of passages making up the following 2 main functional parts: (1) the cochlea, which is dedicated to hearing, and (2) the vestibular system, which is dedicated to balance.\n [1, 2] The inner ear is found in all vertebrates, with substantial variations in form and function. The inner ear is innervated by the eighth cranial nerve in all vertebrates. (See the image below.)\n [3] The superficial contours of the inner ear are established by a layer of dense bone known as the bony labyrinth, which refers to the network of canals. The walls of the bony labyrinth are continuous with the surrounding temporal bone. The inner contours of the bony labyrinth closely follow the contours of the membranous labyrinth, a delicate, interconnected network of fluid-filled tubes in which the receptors are found. The walls of the bony labyrinth consist of dense bone everywhere except at 2 small areas near the base of the cochlear spiral. The round window consists of a thin, membranous partition that separates the perilymph of the cochlear chambers from the air-filled middle ear. Collagen fibers connect the boney margins of the opening known as the oval window at the base of the stapes.\n [4] A liquid called perilymph, the properties of which closely resemble those of cerebrospinal fluid, flows between the bony and membranous labyrinths. Another fluid, called endolymph, is contained in the membranous labyrinth. The endolymph has concentrations of electrolytes that differ from those of typical body fluids. The bony labyrinth can be subdivided into the vestibule, 3 semicircular canals, and the cochlea. The vestibule contains a pair of membranous sacs: the saccule (sacculus) and the utricle (utriculus). Receptors in the vestibule provide for sensations of gravity and linear acceleration. The semicircular canals enclose the slender semicircular ducts. Receptors located here are stimulated by rotation of the head. Together with the vestibule, this is called the vestibular complex. The fluid filled chambers within the vestibule are generally continuous with those of the semicircular canals. The cochlea is a bony, spiral-shaped chamber that contains the cochlear duct of the membranous labyrinth. The sense of hearing is provided by receptors within the cochlear duct. A pair of perilymph-filled chambers is found on each side of the duct. The entire apparatus makes turns around a central bony hub, much like a snail shell.\n [4]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/24/13024tn.jpg"
        ]
    },
    "Kidney Anatomy": {
        "description": "The kidneys are paired retroperitoneal structures that are normally located between the transverse processes of T12-L3 vertebrae, with the left kidney typically somewhat more superior in position than the right. The upper poles are normally oriented more medially and posteriorly than the lower poles. The kidneys serve important functions, including filtration and excretion of metabolic waste products (urea and ammonium); regulation of necessary electrolytes, fluid, and acid-base balance; and stimulation of red blood cell production. They also serve to regulate blood pressure via the renin-angiotensin-aldosterone system, controlling reabsorption of water and maintaining intravascular volume. The kidneys also reabsorb glucose and amino acids and have hormonal functions via erythropoietin, calcitriol, and vitamin D activation.\n [1] The kidney anatomy is shown in the image below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/42/12642tn.jpg"
        ]
    },
    "Knee Joint Anatomy": {
        "description": "The anatomy of the knee is reflective of its function in ambulation. Knee stability and pain-free range of motion are important in maintaining daily function. Most commonly, overuse, age, and traumatic injuries cause structural damage to the knee that may limit its function. Therefore, a thorough understanding of the anatomy of the knee is essential to properly diagnosing and treating knee pathology.\n [1, 2] An image depicting the knee joint can be seen below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/52/12052tn.jpg"
        ]
    },
    "Large Intestine Anatomy": {
        "description": "The anatomy of the large intestine includes the cecum (along with appendix) and the colon; in some descriptions (and the author agrees), it also includes the anorectum (rectum and anal canal).\n [1, 2, 3, 4, 5] The large intestine, which is the terminal part of gastrointestinal (GI) tract, is so called because its lumen (diameter) is larger, not because its length is greater, than that of the small intestine (duodenum, jejunum, ileum); in fact, small intestine is longer than the large intestine. The large intestine develops partly from the midgut (from cecum to distal transverse colon), the hindgut (from distal transverse colon to dentate line in anorectum), and proctodeum (below the dentate line). The cecum, which is the proximal blind end (pouch) of the ascending (right) colon, is a blind cul-de-sac below the level of the ileocecal junction that lies in the right iliac fossa. The terminal ileum opens into the cecum at its medial wall, and the opening is guarded by an ileocecal valve. The appendix (an appendage of the cecum), also called vermiform process or vermiform appendix, is a tubular structure with a blind end attached to the cecum. The base of the appendix lies on the posteromedial wall of the cecum 1-2 cm below the ileocecal junction. The tip of the appendix, however, floats in the peritoneal cavity and may be pelvic, preileal, postileal, or even retrocecal in position. The cecum (the widest part of large intestine) leads to the ascending (right) colon, which ascends vertically from right iliac fossa through the right lumbar region into right hypochondrium under the liver. It then takes a right turn and continues as the horizontally placed transverse colon, which reaches across the epigastrium to the left hypochondrium under the spleen. It then takes a right turn again and descends vertically through the left lumbar region to the left iliac fossa as the descending (left) colon. The descending colon is followed by the inverted V-shaped sigmoid colon (the narrowest part of colon), which becomes the rectum at S3 level. The cecum and colon have 3 longitudinal muscular bands called tenia and multiple sacculations called haustra. The rectum lies in the concavity of the sacrococcygeal hollow and changes to the anal canal at the anorectal angle created by the puborectal sling formed by the innermost fibers of the levator ani muscle. The rectum has a dilated middle part called the ampulla, which contains 3 semilunar transverse mucosal folds called \"valves of Houston.\" The rectum is related anteriorly to the urinary bladder (see the image below), prostate, seminal vesicles, and urethra in males and to the uterus, cervix, and vagina in females. Anterior to the rectum is the rectovesical pouch in males and the rectouterine pouch in females. The rectum changes to anal canal at the level of the coccyx. The anal canal is related to the perineal body in front and the anococcygeal body behind; both of these are fibromuscular structures. The greater omentum (gastrocolic ligament) is like an apron with 4 layers of peritoneum (often fused). Two layers go down from stomach and then run upward to be attached to the transverse colon. The appendix, transverse colon, and sigmoid colon have a mesentery (called mesoappendix, transverse mesocolon and sigmoid mesocolon, respectively), but the ascending colon and descending colon and the rectum and anal canal are retroperitoneal; the cecum does not have its own mesentery but is covered in all aspects by peritoneum. There are several peritoneal fossae (eg, superior and inferior ileocecal, subcecal, retrocecal) around the cecum, which can be sites of internal herniation of the small bowel. Transverse mesocolon, containing the middle colic vessels, is attached to the anterior surface of the pancreas. Sigmoid mesocolon, containing superior rectal vessels, has an inverted-V – shaped attachment to the posterior abdominal wall — the tip of the V lying on the pelvic brim over the left ureter. The rectum does not have a proper mesentery, but the soft tissue around the rectum is often referred to as \"mesorectum\" by surgeons. The posterior surface of entire rectum is retroperitoneal (extraperitoneal). Its upper third is covered by peritoneum on the front and sides, the middle third is covered by peritoneum on the front only, and the lower third is completely retroperitoneal (extraperitoneal). The large intestine, especially the colon, is covered with numerous omental appendages (appendices epiploicae)—appendages of fat, each containing a vessel of its own from the colonic wall. These are visible during surgery.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/01/12701tn.jpg"
        ]
    },
    "Laryngeal Nerve Anatomy": {
        "description": "The larynx serves multiple functions, including control of respiration, airway protection, coordination of swallowing, and phonation. Several nerves in the larynx control these tasks. Each hemilarynx receives its innervation from ipsilateral branches of the vagus.",
        "image_urls": []
    },
    "Larynx Anatomy": {
        "description": "The larynx is located within the anterior aspect of the neck, anterior to the inferior portion of the pharynx and superior to the trachea. Its primary function is to protect the lower airway by closing abruptly upon mechanical stimulation, thereby halting respiration and preventing the entry of foreign matter into the airway. Other functions of the larynx include the production of sound (phonation), coughing, the Valsalva maneuver, and control of ventilation, and acting as a sensory organ. The larynx is composed of 3 large, unpaired cartilages (cricoid, thyroid, epiglottis); 3 pairs of smaller cartilages (arytenoids, corniculate, cuneiform); and a number of intrinsic muscles (see the image and video below). The hyoid bone, while technically not part of the larynx, provides muscular attachments from above that aid in laryngeal motion.\n [1, 2, 3, 4, 5] Cricoid cartilage The cricoid cartilage is a ring of hyaline cartilage located at the inferior aspect of the larynx and is the only complete ring of cartilage around the trachea. It has the shape of a \"signet ring,\" with a broad portion posterior to the airway (lamina of cricoid cartilage) and a narrower portion circling anteriorly (arch of cricoid cartilage). The posterior surface of the lamina contains 2 oval depressions, which serve as attachment sites for the posterior cricoarytenoid muscles, separated by a vertical midline ridge that serves as an attachment to the esophagus. At the junction of the lamina with the arch, small, round articular facets exist on the outer posterolateral surface of each side of the ring that articulate with the inferior horn of the thyroid cartilage. The lower border of the cricoid cartilage is connected to the first tracheal ring by the cricotracheal ligament. The upper border of the cricoid cartilage gives attachment to the cricothyroid ligament on the anterior midline, the cricothyroid muscles on the lateral aspects, and the bases of a pair of arytenoid cartilages on both sides of the posterior aspect. Thyroid cartilage The thyroid cartilage is the largest of the laryngeal cartilages. It is formed by a right and a left lamina that are separated posteriorly and joined together at an acute angle in the anterior midline, forming the laryngeal prominence, commonly known as the Adam’s apple. The laryngeal prominence is more apparent in men, because the angle between the 2 laminae is more acute in men (90°) than in women (120°). The superior thyroid notch is a V-shaped notch immediately above the laryngeal prominence, while the inferior thyroid notch is less distinct and located in the midline along the base of the cartilage (see the image below). The 2 laminae are quadrilateral in shape and form the lateral surfaces of the thyroid cartilage that extend obliquely to cover each side of the trachea. The posterior aspect of each lamina is elongated to form a superior horn and inferior horn. The medial surfaces of the inferior horns articulate with the outer posterolateral surface of the cricoid cartilage. The inferior border of the thyroid cartilage is attached to the cricoid cartilage by the cricothyroid membrane in the midline and the cricothyroid muscles on either side. The superior horn along with the entire superior edge of the thyroid cartilage is attached to the hyoid bone by the thyrohyoid membrane. Epiglottis The epiglottis is a leaf-shaped cartilage that moves down to form a lid over the glottis and protect the larynx from aspiration of foods or liquids being swallowed. It is attached by its stem to the midline of the inner aspect of the thyroid cartilage, about halfway between the angle of the laryngeal prominence and the inferior notch. It is attached via the thyroepiglottic ligament and projects posterosuperiorly to cover the superior opening of the larynx. The midline of the superior surface of the epiglottis is also attached to the body of the hyoid bone via the hyoepiglottic ligament. The mucous membrane covering the upper anterior part of the epiglottis reflects off the sides of the epiglottis, giving rise to the glossoepiglottic folds. The aryepiglottic folds are mucosal folds on the posterior surface of the epiglottis. The depressions on either side of the median fold, between the root of the tongue and the epiglottis, are called the valleculae epiglottica. Arytenoid cartilages The arytenoid cartilages form the part of the larynx to which the vocal ligaments and vocal folds attach. They are pyramidal in shape and have 3 surfaces, a base, and an apex. They are located superior to the cricoid cartilage in the posterior part of the larynx, with the base of the arytenoid cartilages articulating on either side with the posterior aspect of the upper border of the cricoid lamina. The anterior angle of the base of the arytenoid cartilage is elongated to form a vocal process for attachment of the vocal ligament, while the lateral angle is elongated to form a muscular process for attachment of the posterior and lateral cricoarytenoid muscles. The posterior surface of the arytenoid cartilage gives attachment to the arytenoid muscle. The anterolateral surface has 2 depressions for attachment to the false vocal cord (vestibular ligament) and the vocalis muscle. The medial surface has a mucosal lining that forms the lateral aspect of the respiratory part of the glottis. The apex of the arytenoid cartilage is pointed and articulates with the corniculate cartilage. Corniculate cartilages The corniculate cartilages are 2 small, conical cartilages that articulate with the apices of the arytenoid cartilages, serving to extend them posteriorly and medially. They are located in the posterior parts of the aryepiglottic folds of mucous membrane. Cuneiform cartilages The cuneiform cartilages are 2 small, club-shaped cartilages that lie anterior to the corniculate cartilages in the aryepiglottic folds. They form small, whitish elevations on the surface of the mucous membrane just anterior of the arytenoid cartilages. Extrinsic ligaments The thyrohyoid membrane is a broad fibroelastic ligament that spans between the superior border of the thyroid cartilage and the hyoid bone above. It contains an aperture on the lateral surfaces of each side for the superior laryngeal arteries, nerves, and lymphatics. The hyoepiglottic ligament extends from the midline of the superior surface of the epiglottis to the body of the hyoid bone, located anterosuperiorly. The cricotracheal ligament connects the lower border of the cricoid cartilage to the upper border of the first tracheal cartilage ring. Intrinsic ligaments The conus elasticus, a submucosal membrane, extends superiorly from the anterior arch of the cricoid cartilage and attaches to the thyroid cartilage anteriorly and the vocal processes of the arytenoid cartilages posteriorly. The free superior margin of the conus elasticus is thickened to form the vocal ligament, which forms the vocal folds (true vocal cords) once covered by mucosa. The quadrangular membrane, another submucosal sheet, extends between the lateral aspects of the epiglottis and the anterolateral surface of the arytenoid cartilages on each side. The free lower inferior margin of this membrane is thickened to form the vestibular ligament, which forms the vestibular folds (false vocal cords) once covered by mucosa. Laryngeal cavity The laryngeal central cavity is tubular in shape and lined with mucosa. The superior aspect of the cavity (laryngeal inlet) opens into the pharynx, inferior and posterior to the tongue. The inferior aspect of the cavity is continuous with the lumen of the trachea. The laryngeal cavity may be divided into 3 major regions: the vestibule, the middle, and the infraglottic space. The vestibule is the upper portion of the cavity, in between the laryngeal inlet and the vestibular folds. The middle portion of the cavity, or the voice box, is formed by the vestibular folds above and the vocal folds below. The infraglottic space is the lower portion of the cavity, in between the vocal folds and inferior opening of the larynx into the trachea. Laryngeal ventricles and saccules On either side of the middle laryngeal cavity, between the vestibular and vocal folds, the mucosa bulges laterally to form troughs known as the laryngeal ventricles. The laryngeal saccules are tubular extensions of each ventricle anterosuperiorly between the vestibular fold and the thyroid cartilage. It is thought that the walls of these saccules contain many mucous glands that lubricate the vocal folds. Rima vestibuli and rima glottidis The rima vestibuli is the triangular-shaped opening between the 2 adjacent vestibular folds. The apex lies anterior and the base is formed by the posterior wall of the laryngeal cavity. The rima glottidis is a narrower, triangular-shaped opening that lies beneath the rima vestibuli, formed by the 2 adjacent vocal folds. Piriform recesses The piriform recesses (piriform sinuses) are present on either side of the anterolateral wall of the laryngopharynx. They are bounded medially by the aryepiglottic folds and laterally by the thyroid cartilage and thyrohyoid membrane. They are a common place for food to become trapped. Cricothyroid muscles The cricothyroid muscles are attached to the anterolateral surfaces of the arch of the cricoid cartilage and expand superiorly and posteriorly to attach to the inferior border of the thyroid cartilage. They are the only laryngeal muscles supplied by the external branch of the superior laryngeal nerve, a branch of vagus nerve (cranial nerve [CN] X) below the base of the skull. These muscles function to elevate the anterior arch of the cricoid cartilage and depress the posterior portion of the thyroid cartilage lamina. This produces tension and elongation of the vocal cords, resulting in higher-pitch phonation. Posterior cricoarytenoid muscles The posterior cricoarytenoid muscles extend from the oval depressions on the posterior surface of the cricoid lamina on each side and extend upward to the muscular process of the arytenoid cartilage on the same side. These muscles function to rotate the arytenoid cartilages laterally, thereby abducting the vocal cords. Their action opposes that of the lateral cricoarytenoid muscles. The posterior cricoarytenoid muscles receive innervation from the recurrent laryngeal branch of the vagus nerve (CN X). Lateral cricoarytenoid muscles The lateral cricoarytenoid muscle on each side extends from the upper border of the arch of the cricoid cartilage to the muscular process of the arytenoid cartilage on the same side. These muscles function to rotate the arytenoid cartilages medially, thereby adducting the vocal cords. The lateral cricoarytenoid muscles receive innervation from the recurrent laryngeal branch of the vagus nerve (CN X). Transverse arytenoid muscle The transverse arytenoid muscle is a single muscle that extends between the posterior surfaces of each arytenoid cartilage. Its main function is adduction of the vocal cords, and it is innervated by both recurrent laryngeal branches of the vagus nerves (CN X). Thyroarytenoid muscles The thyroarytenoid muscles run from a vertical line on the interior surface of the thyroid cartilage angle and adjacent to the external surface of the cricothyroid ligament to the anterolateral surface of the arytenoid cartilage. Each muscle consists of 2 parts: the vocalis and thyroepiglottic part. The vocalis part lies deep and inferior, parallel with the vocal ligament to which it is attached at the posterior end. The thyroepiglottic part is occasionally described as a separate muscle; it lies superior and continues into the aryepiglottic fold, where some fibers extend to the margin of the epiglottis. These muscles function to draw the arytenoid cartilages forward, thereby relaxing and shortening the vocal cords, while also rotating the arytenoid cartilages inward, thus adducting the vocal folds and narrowing the rima glottis. The thyroarytenoid muscles receive innervation from the recurrent laryngeal branch of the vagus nerve (CN X). Superior laryngeal nerve The superior laryngeal nerves arise from the inferior ganglia of the vagus nerve and receive a branch from the superior cervical sympathetic ganglion on each side in the upper neck. They descend adjacent to the pharynx on either side, behind the internal carotid artery, and divide into internal and external branches. The external branch (external laryngeal nerve) descends beneath the sternothyroid muscle and supplies the cricothyroid muscle. Injury to this nerve during thyroidectomy or cricothyrotomy causes hoarseness of the voice and an inability to produce high-pitched sounds. The internal branch (internal laryngeal nerve) pierces the thyrohyoid membrane and supplies sensory innervation to the laryngeal cavity down to the level of the vocal folds. It is responsible for the cough reflex. Recurrent laryngeal branch of the vagus nerve (CN X) The recurrent laryngeal branches of the vagus nerves ascend into the larynx within the groove between the esophagus and the trachea. The left recurrent laryngeal nerve originates in the thorax, looping under the aortic arch before ascending, while the right recurrent laryngeal nerve originates in the neck. These nerves are responsible for supplying sensory innervation to the laryngeal cavity below the level of the vocal folds, as well as motor innervation to all laryngeal muscles except the cricothyroid. Since the nerves run immediately posterior to the thyroid gland, they are at risk of injury during thyroidectomies. Unilateral nerve damage presents with voice changes, including hoarseness. Bilateral nerve damage may result in aphonia (inability to speak) and breathing difficulties. Arteries The superior and inferior laryngeal arteries supply the majority of blood to the larynx. The superior laryngeal artery originates from the superior thyroid branch of the external carotid artery and enters the larynx with the internal branch of the superior laryngeal nerve through the lateral aperture of the thyrohyoid membrane. The inferior laryngeal artery originates from the inferior thyroid branch of the thyrocervical trunk, which is a branch of the subclavian artery. It ascends into the larynx within the groove between the esophagus and the trachea, along with the recurrent laryngeal branch of the vagus nerve (CN X). Veins The superior and inferior laryngeal veins drain the larynx and share the same course as the arteries. The superior laryngeal veins drain into the superior thyroid veins, which empty into the internal jugular veins. The inferior laryngeal veins drain into the inferior thyroid veins, which both empty into the left brachiocephalic vein. Lymphatics The lymphatic vessels that drain above the vocal folds travel along the superior laryngeal artery and drain to the deep cervical lymph nodes at the bifurcation of the common carotid artery. The lymphatic vessels that drain below the vocal folds travel along the inferior thyroid artery and drain to the upper tracheal lymph nodes.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/62/12762tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/64/12764tn.jpg"
        ]
    },
    "Lips and Perioral Region Anatomy": {
        "description": "The lips surround the entrance to the oral cavity. They function to provide competence to the oral cavity during mastication and at rest. The lips affect uttered sounds that facilitate spoken language and provide changes of facial expression that facilitate unspoken language. They provide sensory information about food prior to its placement in the oral cavity. To accomplish the multitude of functions, lips require a complex system of muscles and supporting structures.\n [1, 2, 3] The upper lip extends from the base of the nose superiorly to the nasolabial folds laterally and to the free edge of the vermilion border inferiorly. The lower lip extends from the superior free vermilion edge superiorly, to the commissures laterally, and to the mandible inferiorly. Around the circumferential vermilion-skin border, a fine line of pale skin accentuates the color difference between the vermilion and normal skin. Along the upper vermilion-skin border, 2 paramedian elevations of the vermilion form the Cupid bow. Two raised vertical columns of tissue form a midline depression called the philtrum. The philtrum is located between the paramedian elevations of the vermilion and the columella above. The labiomental crease passes horizontally in an inverted U-shape across the lower lip, which intraorally corresponds to the depth of the gingivolabial sulcus.",
        "image_urls": []
    },
    "Liver Anatomy": {
        "description": "The liver is the second largest (after the skin) organ in the human body and the largest gland (weighing an average of 1500 g). It lies under the diaphragm in the right upper abdomen and midabdomen and extends to the left upper abdomen. The liver has the general shape of a prism or wedge, with its base to the right and its apex to the left (see the image below). It is pinkish brown in color, with a soft consistency, and is highly vascular and easily friable.\n [1]  Confusion surrounds the nomenclature of liver anatomy. The International Hepto-Pancreato-Biliary Association (IHPBA) terminology of liver anatomy and resections is followed by most liver surgeons.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/74/12174tn.jpg"
        ]
    },
    "Lower GI Tract Anatomy": {
        "description": "The gastrointestinal (GI), or digestive, tract extends from mouth to anus (see the image below). The division of the GI tract into upper and lower is a matter of some confusion and debate. On embryologic grounds, the GI tract should be divided into upper (mouth to major papilla in the duodenum), middle (duodenal papilla to midtransverse colon), and lower (mid-transverse colon to anus) according to the derivation of these 3 areas from the foregut, midgut, and hindgut, respectively. Nevertheless, the GI tract is conventionally divided into upper (mouth to ileum) and lower (cecum to anus). From the point of view of GI bleeding, however, the demarcation between the upper and lower GI tract is the duodenojejunal (DJ) junction (ligament of Treitz); bleeding above the DJ junction is called upper GI bleeding, and that below the DJ junction is called lower GI bleeding.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/54/12054tn.jpg"
        ]
    },
    "Lumbar Spine Anatomy": {
        "description": "The lumbar spine consists of 5 moveable vertebrae numbered L1-L5. The complex anatomy of the lumbar spine is a remarkable combination of these strong vertebrae, multiple bony elements linked by joint capsules, and flexible ligaments/tendons, large muscles, and highly sensitive nerves. It also has a complicated innervation and vascular supply.\n [1, 2, 3, 4, 5, 6, 7] The lumbar spine is designed to be incredibly strong, protecting the highly sensitive spinal cord and spinal nerve roots. At the same time, it is highly flexible, providing for mobility in many different planes including flexion, extension, side bending, and rotation. An image depicting the lower lumbar spine can be seen below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/56/12056tn.jpg"
        ]
    },
    "Lung Anatomy": {
        "description": "The anatomy of the respiratory system can be divided into 2 major parts, airway anatomy and lung anatomy. Airway anatomy can be further subdivided into the following 2 segments: The extrathoracic (superior) airway, which includes the supraglottic, glottic, and infraglottic regions The intrathoracic (inferior) airway, which includes the trachea, the mainstem bronchi, and multiple bronchial generations (which have as their main function the conduction of air to the alveolar surface) Lung anatomy includes the lung parenchyma, which carries part of the conduction system but is mainly involved in the gas exchange at the alveolar level. The lung parenchyma is further subdivided into lobes and segments. The purpose of this chapter is to provide a better understanding of the anatomy of the airways and lungs, which will help the health provider to recognize and manage different respiratory abnormalities.",
        "image_urls": []
    },
    "Lymphatic System Anatomy": {
        "description": "The lymphatic system parallels the cardiovascular system (see the images below). The lymphatic system is unique, in that it is a 1-way system that returns lymph fluid via vessels to the cardiovascular system for eventual elimination of toxic byproducts by end organs, such as the kidney, liver, colon, skin, and lungs. The lymphatic system consists of the following (see Table 1 below): Fluid, known as lymph Vessels that transport lymph Organs that contain lymphoid tissue (eg, lymph nodes, spleen, and thymus) Table 1. Key Components of Lymphatic System (Open Table in a new window) Organ Function Lymph Contains nutrients, oxygen, hormones, and fatty acids, as well as toxins and cellular waste products, that are transported to and from cellular tissues Lymphatic vessels Transport lymph from peripheral tissues to the veins of the cardiovascular system Lymph nodes Monitors the composition of lymph, the location of pathogen engulfment and eradication, the immunologic response, and the regulation site Spleen Monitors the composition of blood components, the location of pathogen engulfment and eradication, the immunologic response, and the regulation site Thymus Serves as the site of T-lymphocyte maturation, development, and control The lymphatic system’s main functions are as follows: Restoration of excess interstitial fluid and proteins to the blood Absorption of fats and fat-soluble vitamins from the digestive system and transport of these elements to the venous circulation Defense against invading organisms\n [1, 2, 3, 4]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/67/12067tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/68/12068tn.jpg"
        ]
    },
    "Male Reproductive Organ Anatomy": {
        "description": "The male reproductive system is a network of external and internal organs that function to produce, support, transport, and deliver viable sperm for reproduction. Prenatally, the male sex organs are formed under the influence of testosterone secreted from the fetal testes; by puberty, the secondary sex organs further develop and become functional. Sperm is produced in the testes and is transported through the epididymis, ductus deferens, ejaculatory duct, and urethra. Concomitantly, the seminal vesicles, prostate gland, and bulbourethral gland produce seminal fluid that accompany and nourish the sperm as it is emitted from the penis during ejaculation and throughout the fertilization process (see image below).",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/73/12073tn.jpg"
        ]
    },
    "Male Urethra Anatomy": {
        "description": "The male urethra is a narrow fibromuscular tube that conducts urine and semen from the bladder and ejaculatory ducts, respectively, to the exterior of the body (see the image below). Although the male urethra is a single structure, it is composed of a heterogeneous series of segments: prostatic, membranous, and spongy. Most proximally, the prostatic urethra is responsible for involuntary continence, transmission of semen into the common genitourinary tract, and the most common site of bladder outlet obstruction in the Western world. The membranous urethra is critical to voluntary continence and, because of its rigid attachments, is highly susceptible to injury in pelvic trauma. The spongy urethra is surrounded by the corpus spongiosum and forms the terminal conduit communicating with the outside of the body. Knowledge of male urethral anatomy is essential for all health professionals because urethral catheterization is one of the most commonly performed procedures in health care. The male urethra is susceptible to a variety of pathologic conditions, ranging from traumatic to infectious to neoplastic. Pathophysiologic variants of the urethra may have devastating consequences, such as renal failure and infertility.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/74/13074tn.jpg"
        ]
    },
    "Male Urinary Organ Anatomy": {
        "description": "An understanding of the anatomy of the male urinary organs, namely the male urethra and penis, is crucial to the diagnosis and treatment of urologic conditions. The kidney anatomy, ureter anatomy, and bladder anatomy are similar in males and females, as discussed in the respective articles. Most sex differences in the urinary tract begin at the bladder neck and continue distally, with the exception of the vas deferens (see the image below), which is shown crossing the distal ureter. This article reviews the basic anatomy of the male urinary organs and common anatomical variants, along with the issues they may present.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/83/12083tn.jpg"
        ]
    },
    "Metacarpophalangeal and Interphalangeal Ligament Anatomy": {
        "description": "This article discusses the ligamentous structures of the metacarpophalangeal (MP) joints (see the first image below), proximal interphalangeal (PIP) joints, and distal interphalangeal (DIP) joints. Additionally, the thumb has 2 joints that will be discussed here, the MP joint and the interphalangeal (IP) joint (see the second image below). The fingers (index through small fingers) are composed of 3 bones each and are all associated with a single metacarpal. Thus, 3 joints per finger exist, all of which have significant motion and require stabilization to prevent subluxation and dislocation. The thumb has 2 bones and a metacarpal for an additional 2 joints. Stabilization is done with a combination of bony restraints, ligaments, and other static soft-tissue stabilizers, and the dynamic action of muscles. Generally, ligaments are stabilizers of joints. Without them, many of our joints would dislocate or have far too much abnormal motion, leading to degeneration and pain. Providing stability to joints also allows for pressure to be exerted by limbs, fingers, etc, in planes other than the axial plane. Ligaments can be perfectly isometric, meaning they are equally tight throughout the entire arc of motion of a joint, or they can be functionally involved in only a portion of the arc of motion.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/56/12356tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/57/12357tn.jpg"
        ]
    },
    "Mitral Valve Anatomy": {
        "description": "The human heart has 4 valves. The mitral valve connects the left atrium (LA) and the left ventricle (LV). The mitral valve opens during diastole to allow the blood flow from the LA to the LV. During ventricular systole, the mitral valve closes and prevents backflow to the LA. The normal function of the mitral valve depends on its 6 components, which are (1) the left atrial wall, (2) the annulus, (3) the leaflets, (4) the chordae tendineae, (5) the papillary muscles, and (6) the left ventricular wall (see the image below).\n [1] Any congenital or acquired disorder of individual components can disturb the finely coordinated mechanisms of the mitral valve and result in an incompetent valve.\n [1] This article summarizes basic gross anatomy, microscopic anatomy, and pathophysiologic variants of the mitral valve disorders.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/97/11497tn.jpg"
        ]
    },
    "Mouth Anatomy": {
        "description": "The oral cavity represents the first part of the digestive tube. Its primary function is to serve as the entrance of the alimentary tract and to initiate the digestive process by salivation and propulsion of the alimentary bolus into the pharynx.\n [1, 5] It also serves as a secondary respiratory conduit, a site of sound modification for the production of speech, and a chemosensory organ.\n [5] The mobility of the lips is also critical to speech production, whistling, singing, the playing of wind and brass musical instruments, expectoration, and human behavioral communication (eg, kissing, smiling, pouting, baring of teeth).\n [5] Even minor disruptions in the function of the oral cavity can seriously jeopardize an individual’s quality of life.\n [5] The oral cavity (see the image below) is oval shaped and is separated into the oral vestibule and the oral cavity proper.\n [2] It is bound by the lips anteriorly, the cheeks laterally, the floor of the mouth inferiorly, the oropharynx posteriorly, and the palate superiorly.\n [1] The oropharynx begins superiorly at the junction between the hard palate and the soft palate, and inferiorly behind the circumvallate papillae of the tongue.\n [3] The bony base of the oral cavity is represented by the maxillary and mandibular bones.\n [4] The oral cavity includes the lips, gingivae, retromolar trigone, teeth, hard palate, cheek mucosa, mobile tongue, and floor of the mouth. The major salivary glands are in close relation with oral cavity structures, although they are not part of the oral cavity. The tongue is part of the oral cavity; its anatomy is specifically described elsewhere (see Tongue Anatomy). The palatine tonsils, soft palate, tongue base, and posterior pharyngeal walls are part of the oropharynx; the oropharynx is not part of the oral cavity.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/90/12090tn.jpg"
        ]
    },
    "Muscular System Anatomy": {
        "description": "Muscle fibers can broadly be divided into 3 muscles types: skeletal, cardiac, and smooth muscle. This summary discusses the basic anatomy of skeletal muscle, key features of skeletal muscle histology and physiology, and important presentations of muscular disease. Most of the skeletal muscular system is arranged into groups of agonists and antagonist muscles that work in concert to provide efficient and controlled motion. This is achieved through the complex interaction of the musculoskeletal system with the pyramidal, extrapyramidal, and sensory components of the nervous system. This article mainly focuses on the end organ of this complex interaction, the muscle fiber (myofiber). The different types of myofibers and their functional responsibilities are also discussed.",
        "image_urls": []
    },
    "Nail Anatomy": {
        "description": "The nail organ is an integral component of the digital tip. It is a highly versatile tool that protects the fingertip, contributes to tactile sensation by acting as a counterforce to the fingertip pad, and aids in peripheral thermoregulation via glomus bodies in the nail bed and matrix.\n [1, 2] Because of its form and functionality, abnormalities of the nail unit result in functional and cosmetic issues. The structures that define and produce the nail (nail plate) include the matrix (sterile and germinal), the proximal nail fold, the eponychium, the paronychium, and the hyponychium (see the images below). Collectively, the nail bed (sterile matrix), nail fold, eponychium, paronychium, and hyponychium are referred to as the perionychium. See 15 Fingernail Abnormalities: Nail the Diagnosis, a Critical Images slideshow, to help identify conditions associated with various nail abnormalities.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/58/12658tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/60/12660tn.jpg"
        ]
    },
    "Nasal Anatomy": {
        "description": "The developmental precursors of the nose are the neural crest cells, which commence their caudad migration toward the midface around the fourth week of gestation. Two nasal placodes develop inferiorly in a symmetrical fashion. Nasal pits divide the placodes into medial and lateral nasal processes. The medial processes become the septum, philtrum, and premaxilla of the nose, whereas the lateral processes form the sides of the nose. Inferior to the nasal complex, the stomodeum, or future mouth, forms. (See the image below.) A nasobuccal membrane separates the oral cavity inferiorly from the nasal cavity superiorly. As the olfactory pits deepen, the choanae are formed. Primitive choanae form initially, but with continued posterior development, the secondary, or permanent, choanae develop. By 10 weeks, differentiation into muscle, cartilage, and bony elements occurs. Failure of these carefully orchestrated events in early facial embryogenesis may result in multiple potential anomalies, including choanal atresia, medial or lateral nasal clefts, nasal aplasia, and polyrrhinia.\n [1] Neonates are obligate nasal breathers for the first 6 weeks. When bilateral choanal atresia is present in a neonate, emergency action is needed.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/65/24465tn.jpg"
        ]
    },
    "Nasolacrimal System Anatomy": {
        "description": "The nasolacrimal drainage system serves as a conduit for tear flow from the external eye to the nasal cavity. It consists of the puncta, canaliculi, lacrimal sac, and nasolacrimal duct (see the image below). At 32 days' embryonic gestation, the maxillary and frontonasal prominences appear, and as these processes enlarge, a groove forms between them (see the image below). Ectoderm from the floor of the groove becomes entrapped between the processes and detaches from the surface ectoderm as a cord of epithelium. At the same time, cords of epithelium invaginate at the upper and lower lid margins, eventually forming the canaliculi. These epithelial cords fuse to form the nasolacrimal drainage system.\n [1] Canalization of the epithelial cords occurs simultaneously throughout their entire length, beginning at 4 months' gestation. Remnants of epithelium within the cords form inconsistent, valvelike folds. A membranous covering consisting of conjunctival and canalicular epithelium remains over the puncta (see the image below), and a covering consisting of nasal and nasolacrimal epithelium remains over the nasolacrimal duct outlet (ie, the membrane of Hasner). Punctal membranes open at full term; however, the membrane of Hasner remains imperforate in up to 70% newborns. This usually opens within the first month but may remain imperforate for a longer time, resulting in epiphora and/or mucopurulent discharge. Rapid growth of the maxillary bone in relation to the frontal bone results in greater lateral stretching of the inferior canaliculus with a subsequent lateral position of the inferior punctum with respect to the superior punctum. Epithelium at the site of the future lacrimal sac is initially thicker, and canalization in this area is more extensive.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/60/24460tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/61/24461tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/62/24462tn.jpg"
        ]
    },
    "Neck Anatomy": {
        "description": "The neck is the part of the body that separates the head from the torso. The Latin-derived term cervical means \"of the neck.\" The neck supports the weight of the head and is highly flexible, allowing the head to turn and flex in different directions. The midline in front of the neck has a prominence of the thyroid cartilage termed the laryngeal prominence, or the so-called \"Adam's apple.\" Between the Adam’s apple and the chin, the hyoid bone can be felt; below the thyroid cartilage, a further ring that can be felt in the midline is the cricoid cartilage. Between the cricoid cartilage and the suprasternal notch, the trachea and isthmus of the thyroid gland can be felt. The quadrangular area is on the side of the neck and is bounded superiorly by the lower border of the body of the mandible and the mastoid process, inferiorly by the clavicle, anteriorly by a midline in front of the neck, and posteriorly by the trapezius muscle. The cervical spine is made of 7 cervical vertebrae deemed C1 to C7. The cervical portion of the spine has a gentle forward curve called the cervical lordosis. Certain cervical vertebrae have atypical features and differ from the general form of a typical vertebra. The main arteries in the neck are the common carotids, and the main veins of the neck that return the blood from the head and face are the external and internal jugular veins.",
        "image_urls": []
    },
    "Olfactory System Anatomy": {
        "description": "The olfactory system represents one of the oldest sensory modalities in the phylogenetic history of mammals. (See the image below.) As a chemical sensor, the olfactory system detects food and influences social and sexual behavior. The specialized olfactory epithelial cells characterize the only group of neurons capable of regeneration. Activation occurs when odiferous molecules come in contact with specialized processes known as the olfactory vesicles.\n [1] Within the nasal cavity, the turbinates or nasal conchae serve to direct the inspired air toward the olfactory epithelium in the upper posterior region. This area (only a few centimeters wide) contains more than 100 million olfactory receptor cells. These specialized epithelial cells give rise to the olfactory vesicles containing kinocilia, which serve as sites of stimulus transduction. Olfaction is less developed in humans than in other mammals, such as rodents.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/95/24495tn.jpg"
        ]
    },
    "Orbit Anatomy": {
        "description": "The orbit, which protects, supports, and maximizes the function of the eye, is shaped like a quadrilateral pyramid, with its base in plane with the orbital rim. Seven bones conjoin to form the orbital structure, as shown in the image below.\n [1] The orbital process of the frontal bone and the lesser wing of the sphenoid form the orbital roof. The orbital plate of the maxilla joins the orbital plate of the zygoma and the orbital plate of the palatine bones to form the floor. Medially, the orbital wall consists of the frontal process of the maxilla, the lacrimal bone, the sphenoid, and the thin lamina papyracea of the ethmoid. The lateral wall is formed by the lesser and greater wings of the sphenoid and the zygoma. The orbits are aligned so that the medial walls are parallel and the lateral walls are perpendicular.\n [2] The arc from medial to lateral wall in each orbit is 45°. Lines dropped through a central anterior-to-posterior axis of each orbit bisect at a 45° angle. The floor is two-thirds the depth of the orbit. The average dimensions of the orbit are as follows: Height of orbital margin - 40 mm Width of orbital margin - 35 mm Depth of orbit - 40-50 mm Interorbital distance - 25 mm Volume of orbit - 30 cm3 The superficial bony orbit is defined by the orbital margin, which is rectangular with rounded corners. The margin is discontinuous at the lacrimal fossa. The supraorbital notch (seen in the image below) is within the supraorbital rim and is closed to form the supraorbital foramen in 25% of individuals. The supratrochlear notch is medial to the supraorbital notch. The trochlea is a cartilaginous ring that supports the superior oblique muscle. The trochlea attaches to the periorbita within the fovea trochlearis along the superior-medial orbit. The infraorbital foramen is located 10 mm inferior to the zygomaxillary suture.\n [3, 4] Laterally, the orbital rim is marked by the Whitnall tubercle, which is 10 mm inferior to the zygomaticofrontal suture. The tubercle is the site of attachment of the lateral canthal tendon. The major nerves and vessels to the orbit and globe enter through 3 openings. The superior orbital fissure is bounded by the lesser and greater wings of the sphenoid. The greater wing of the sphenoid, the maxilla, and the palatine bones of the orbit form the boundaries of the inferior orbital fissure. The optic canal is at the apex of the orbit and lies within the sphenoid bone. The structures entering through the superior orbital fissure are as follows: Cranial nerves (CN) III, IV, and VI Lacrimal nerve Frontal nerve Nasociliary nerve Orbital branch of middle meningeal artery Recurrent branch of lacrimal artery Superior orbital vein Superior ophthalmic vein The structures entering through the inferior orbital fissure are as follows: Infraorbital nerve Zygomatic nerve Parasympathetics to lacrimal gland Infraorbital artery Infraorbital vein Inferior ophthalmic vein branch to pterygoid plexus The structures entering through the optic canal are as follows: Optic nerve Ophthalmic artery Central retinal vein The anterior and posterior ethmoid foramina lie in the medial wall of the orbit along the frontoethmoidal suture line. The anterior and posterior ethmoid arteries pass through these foramina and are important surgical landmarks. The arteries mark the level of the cribriform plate and the relationship of the anterior cranial fossa to the orbits. The ethmoid arteries mark the superior limit for osteotomies during medial maxillectomy. The distance from the orbital rim to the anterior ethmoid artery is approximately 20-25 mm. The distance between the anterior and posterior ethmoid arteries averages 12 mm, with a range of 8-19 mm. The optic ring averages 6 mm from the posterior ethmoid artery, with a range of 5-11 mm. Knowledge of these distances safely guides the surgeon along the medial orbital wall. The infraorbital sulcus crosses the floor of the orbit and carries the infraorbital artery, infraorbital vein, and infraorbital nerve from the inferior orbital fissure to the infraorbital foramen. Clinically, the infraorbital foramen provides a route of spread for infection or maxillary tumors to the orbit and the skull base. The surgeon must avoid injury to the infraorbital neurovascular bundle when performing a midface degloving approach.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/56/24456tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/57/24457tn.jpg"
        ]
    },
    "Orbit Arterial Supply": {
        "description": "The arterial supply to the orbit derives its origin from the internal carotid artery (ICA). In the head and the neck, the common carotid bifurcates at the C4-C5 region. This bifurcation leads to the external carotid artery and the ICA. The internal and external carotid arteries are important vessels because of their blood supply to the orbit, cranial base and dura lining the cranial fosse, and the cranial nerves. The important branches involved in irrigating the orbit include the following: Facial artery and angular artery branch - Supplies orbit and medial lid Occipital artery Superficial temporal artery - Supplies frontal and superior orbit Internal maxillary artery Middle meningeal artery - Major vessel supplying the orbit in the absence of the ophthalmic vessel Anterior deep temporal artery Infraorbital artery",
        "image_urls": []
    },
    "Osteology (Bone Anatomy)": {
        "description": "Although often thought of as a static support structure, the skeletal system is a dynamic organ with many functions, including giving us our human shape, allowing locomotion and motor function, facilitating respiration, protecting vital organs, producing marrow-derived cells, and playing a crucial role in homeostasis.\n [1, 2, 3, 4, 5] Bones are dynamic structures that are undergoing constant change and remodeling in response to the ever-changing environment.\n [3] In fact, there is so much turnover that in 4 years, the skeleton of a young person will be completely new as compared with their skeleton today.\n [1] Bones can react and respond to environmental stimuli; they can get bigger or smaller, they can strengthen themselves when needed, and, when broken, they are among the few organs with the ability to regenerate without scar.\n [1] There are 206 bones (some say 213\n [4] ) in the human body. Some variation exists, because humans may have different numbers of certain bones (eg, vertebrae and ribs). Bones vary widely in size, ranging from the tiny inner ear bones that are responsible for transmitting mechanical sound waves to the sensory organs to the large (nearly 2 ft long) femur bone that is strong enough to withstand 30 times one's body weight.",
        "image_urls": []
    },
    "Ovary Anatomy": {
        "description": "The ovaries are the female pelvic reproductive organs that house the ova and are also responsible for the production of sex hormones. They are paired organs located on either side of the uterus within the broad ligament below the uterine (fallopian) tubes. The ovary is within the ovarian fossa, a space that is bound by the external iliac vessels, obliterated umbilical artery, and the ureter. The ovaries are responsible for housing and releasing ova, or eggs, necessary for reproduction. At birth, a female has approximately 1-2 million eggs, but only 300 of these eggs will ever become mature and be released for the purpose of fertilization. Anatomy of the ovaries is displayed in the images below. The ovaries are small, oval-shaped, and grayish in color, with an uneven surface. The actual size of an ovary depends on a woman’s age and hormonal status; the ovaries, covered by a modified peritoneum, are approximately 3-5 cm in length during childbearing years and become much smaller and then atrophic once menopause occurs. A cross-section of the ovary reveals many cystic structures that vary in size. These structures represent ovarian follicles at different stages of development and degeneration.\n [1, 2, 3] Each month, the ovaries go through a series of stages, depending on stimulation by the anterior pituitary hormones the follicle stimulating hormone (FSH) and the luteinizing hormone (LH). A typical female cycle lasts 28 days; however, this can range from 21-35 days. The ovarian cycle has 2 distinct phases: the follicular phase (days 1-14) and the luteal phase (days 14-28). The follicular phase is characterized by follicle development and growth, the goal being that one follicle matures and releases an egg at the time of ovulation, around day 14 of the female cycle. The remaining immature follicles go through stages of degeneration up until day 28, when the cycle repeats itself. The egg that is released is picked up by the fimbriae of the uterine tube, and the egg is transported toward the uterus. If fertilization does not occur, the egg degenerates, and menstruation occurs. Several paired ligaments support the ovaries. The ovarian ligament connects the uterus and ovary. The posterior portion of the broad ligament forms the mesovarium, which supports the ovary and houses its arterial and venous supply. The suspensory ligament of the ovary (infundibular pelvic ligament) attaches the ovary to the pelvic sidewall. This larger structure also contains the ovarian artery and vein, as well as nerve supply to the ovary. Blood supply to the ovary is via the ovarian artery; both the right and left arteries originate directly from the descending aorta. The ovarian artery and vein enter and exit the ovary at the hilum. The left ovarian vein drains into the left renal vein, and the right ovarian vein empties directly into the inferior vena cava. Nerve supply to the ovaries runs with the vasculature via the suspensory ligament of the ovary, entering the ovary at the hilum. Supply is through the ovarian, hypogastric, and aortic plexuses. Lymph drainage of the ovary is primarily to the lateral aortic nodes; however, the iliac nodes are also involved.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/36/12736tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/37/12737tn.jpg"
        ]
    },
    "Pancreas Anatomy": {
        "description": "The pancreas, named for the Greek words pan (all) and kreas (flesh), is a 12-15–cm long J-shaped (like a hockey stick), soft, lobulated, retroperitoneal organ. It lies transversely, although a bit obliquely, on the posterior abdominal wall behind the stomach, across the lumbar (L1-2) spine (see the image below).\n [1, 2, 3, 4, 5] The pancreas develops as 2 buds (outpouchings) of endoderm from the primitive duodenum at the junction of the foregut and the midgut. A small ventral bud (pouch) forms the lower (inferior) part of the head and the uncinate process of pancreas, whereas a large dorsal bud (pouch) forms the upper (superior) part of the head as well as the body and tail of the pancreas. The ventral bud rotates behind the duodenum dorsally from right to left and fuses with the dorsal bud, and the duct of the distal part (body and tail) of the dorsal bud unites with the duct of the ventral bud to form the main pancreatic duct (of Wirsung). Because the common bile duct (CBD) also arises from the ventral bud, it forms a common channel with the main pancreatic duct. The remaining proximal part (head) of the duct of the dorsal bud remains as the accessory pancreatic duct (of Santorini).",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/76/12676tn.jpg"
        ]
    },
    "Paranasal Sinus Anatomy": {
        "description": "The paranasal sinuses are air-filled spaces located within the bones of the skull and facial bones. They are centered on the nasal cavity and have various functions, including lightening the weight of the head, humidifying and heating inhaled air, increasing the resonance of speech, and serving as a crumple zone to protect vital structures in the event of facial trauma.\n [1, 2] Four sets of paired sinuses are recognized: maxillary, frontal, sphenoid, and ethmoid (see the image below). The maxillary sinus is the largest paranasal sinus and lies inferior to the eyes in the maxillary bone. It is the first sinus to develop and is filled with fluid at birth. It grows according to a biphasic pattern, in which the first phase occurs during years 0-3 and the second during years 6-12. The earliest phase of pneumatization is directed horizontally and posteriorly, whereas the later phase proceeds inferiorly toward the maxillary teeth. This development places the floor of the sinus well below the floor of the nasal cavity. The shape of the sinus is a pyramid, with the base along the nasal wall and the apex pointing laterally toward the zygoma. The natural ostium of the maxillary sinus is located in the superior portion of the medial wall. The anterior maxillary sinus wall houses the infraorbital nerve, which runs through the infraorbital canal along the roof of the sinus and sends branches to the soft tissues of the cheek. The thinnest portion of the anterior wall is above the canine tooth, called the canine fossa, which is an ideal entry site for addressing various disease processes of the maxillary sinus. The roof of the maxillary sinus is the floor of the orbit. Behind the posteromedial wall of the maxillary sinus lies the pterygopalatine fossa, a small inverted space that houses several important neurovascular structures and communicates with several skull base foramina. The infratemporal fossa lies behind the posterolateral wall of the maxillary sinus. The maxillary sinus is supplied by branches of the internal maxillary artery, which include the infraorbital, alveolar, greater palatine, and sphenopalatine arteries. It is innervated by branches of the second division of the trigeminal nerve, the infraorbital nerve, and the greater palatine nerves. The frontal sinus is housed in the frontal bone superior to the eyes in the forehead. It is formed by the upward movement of anterior ethmoid cells after the age of 2. Developmentally, this is the last sinus to pneumatize. Growth increases at age 6 years and continues until the late teenage years.\n [3] The frontal sinuses are funnel-shaped structures with their ostia located in the most dependent portion of the cavities. The posterior wall of the frontal sinus, which separates the sinus from the anterior cranial fossa, is much thinner than its anterior wall. The frontal sinus is supplied by the supraorbital and supratrochlear arteries of the ophthalmic artery. It is innervated by the supraorbital and supratrochlear nerves of the first division of the trigeminal nerve. The sphenoid sinus originates in the sphenoid bone at the center of the head. It arises not from an outpouching of the nasal cavity but from the nasal embryonic lining. The sinus reaches its full size by the late teenage years. The sphenoid sinus is variably pneumatized and may extend as far as the foramen magnum in some patients. The thickness of the walls of the sphenoid sinus is variable, with the anterosuperior wall and the roof of the sphenoid sinus (the planum sphenoidale) being the thinnest bones. The sphenoid sinus ostium is located on the anterosuperior surface of the sphenoid face, usually medial to the superior turbinate. The sphenoid sinus is supplied by the sphenopalatine artery, except for the planum sphenoidale, which is supplied by the posterior ethmoidal artery. Innervation of the sphenoid sinus comes from branches of the first and second divisions of the trigeminal nerve. The ethmoid sinuses arise in the ethmoid bone, forming several distinct air cells between the eyes. They are a collection of fluid-filled cells at birth that grow and pneumatize until the age of 12. The ethmoid cells are shaped like pyramids and are divided by thin septa. They are bordered by the middle turbinate medially and the medial orbital wall laterally. The ethmoid labyrinth may extend above the orbit, lateral and superior to the sphenoid, above the frontal sinus, and into the roof of the maxillary sinus. The ethmoid sinuses are supplied by the anterior and posterior ethmoidal arteries from the ophthalmic artery (internal carotid system), as well as by the sphenopalatine artery from the terminal branches of the internal maxillary artery (external carotid system).",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/03/12103tn.jpg"
        ]
    },
    "Parathyroid Gland Anatomy": {
        "description": "Four parathyroid glands are found near the posterior aspect of the thyroid gland. They are small (20-40 mg) and have a beanlike shape. These 4 glands produce parathyroid hormone (PTH), which helps to maintain calcium homeostasis by acting on the renal tubule as well as calcium stores in the skeletal system and by acting indirectly on the gastrointestinal tract through the activation of vitamin D. The parathyroid glands have a distinct, encapsulated, smooth surface that differs from the thyroid gland, which is has a more lobular surface, and lymph nodes, which are more pitted in appearance. The color of the parathyroid glands is typically light brown to tan, which relates to their fat content, vascularity, and percentage of oxyphil cells within the glands.\n [1] The yellow color may be confused with surrounding fat. A distinct hilar vessel is also present that can be seen if the surrounding fat does not obscure the glands' hila. The superior parathyroid glands are most commonly located in the posterolateral aspect of the superior pole of the thyroid gland at the cricothyroidal cartilage junction. They are most commonly found 1 cm above the intersection of the inferior thyroid artery and the recurrent laryngeal nerve (see the image below). The inferior parathyroid glands are more variable in location and are most commonly found near the lower thyroid pole of the thyroid. The parathyroid glands develop from the endoderm of the third and fourth pharyngeal pouches. The thymus is also derived from the third pharyngeal pouch. The inferior parathyroid glands are derived from the dorsal part of the third pharyngeal pouch, and the thymus arises from the ventral part of the third pharyngeal pouch. As the inferior parathyroid glands and the thymus migrate together toward the mediastinum, they eventually separate. In most cases, the inferior parathyroid glands become localized near the inferior poles of the thyroid, and the thymus continues to migrate toward the mediastinum. The superior parathyroid glands are derived from the fourth pharyngeal pouch and migrate together with the ultimobranchial bodies. The ultimobranchial bodies also develop from the fourth pharyngeal pouch, and, during the fifth week of development, these cells detach from the pharyngeal wall and fuse with the posterior aspect of the main body of the thyroid as it descends into the neck. These cells differentiate into the parafollicular cells (C cells) that secrete calcitonin.\n [2] The superior parathyroid glands migrate a shorter distance than the inferior glands, which results in a relatively more constant location in the neck. Because the superior parathyroid glands travel with the ultimobranchial bodies, they remain in contact with the posterior part of the middle third of the thyroid lobes. See also Embryology of the Thyroid and Parathyroids. The inferior parathyroid gland is supplied by the inferior thyroid artery from the thyrocervical trunk. Studies have shown that in approximately 10% of patients, the inferior thyroid artery is absent, most commonly on the left side. In these cases, a branch from the superior thyroid artery supplies the inferior parathyroid gland.\n [3] Inferior parathyroid glands that descend into the anterior mediastinum are usually vascularized by the inferior thyroid artery. If a parathyroid is positioned low in the mediastinum, it may be supplied by a thymic branch of the internal thoracic artery or even a direct branch of the aortic arch.\n [4] The superior parathyroid gland is also usually supplied by the inferior thyroid artery or by an anastomotic branch between the inferior thyroid and the superior thyroid artery. Several studies have indicated that in 20-45% of cases, the superior parathyroid glands receive significant vascularity from the superior thyroid artery. This is usually in the form of a posterior branch of the superior thyroid artery given off at the level of the superior pole of the thyroid.\n [5, 6]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/30/12730tn.jpg"
        ]
    },
    "Penis Anatomy": {
        "description": "The penile shaft is composed of 3 erectile columns, the 2 corpora cavernosa and the corpus spongiosum, as well as the columns' enveloping fascial layers, nerves, lymphatics, and blood vessels, all covered by skin (see the following images). The 2 suspensory ligaments, composed of primarily elastic fibers, support the penis at its base.\n [1] The paired corpora cavernosa contain erectile tissue and are each surrounded by the tunica albuginea, a dense fibrous sheath of connective tissue with relatively few elastic fibers. The corpora cavernosa communicate freely through an incomplete midline septum. Proximally, at the base of the penis, the septum is more complete; ultimately, the corpora diverge, forming the crura, which attach to the ischiopubic rami. The tunica albuginea consists of 2 layers, the outer longitudinal and the inner circular (see the image below). The tunica albuginea becomes thicker ventrally where it forms a groove to accommodate the corpus spongiosum. The tunica albuginea of the corpus spongiosum is considerably thinner (< 0.5 mm) than that of the corpora cavernosa (approximately 2 mm). Along the inner aspect of the tunica albuginea, flattened columns or sinusoidal trabeculae composed of fibrous tissue and smooth muscle surround the endothelial-lined sinusoids (cavernous spaces). In addition, a row of structural trabeculae arises near the junction of the 3 corporal bodies and inserts in the walls of the corpora about the midplane of the circumference.\n [2] The erectile tissue within the corpora contains arteries, nerves, muscle fibers, and venous sinuses lined with flat endothelial cells, and it fills the space of the corpora cavernosa. The cut surface of the corpora cavernosa looks like a sponge. There is a thin layer of areolar tissue that separates this tissue from the tunica albuginea. Blood flow to the corpora cavernosa is via the paired deep arteries of the penis (cavernosal arteries), which run near the center of each corpora cavernosa (see the following image). The single corpus spongiosum lies in the ventral groove between the 2 corpora cavernosa. The urethra passes through the corpus spongiosum. The corpus spongiosum possesses a much thinner and more elastic tunica albuginea to allow for distention of the corpus spongiosum for passage of the ejaculate through the urethra. The thinner tunica albuginea of the corpus spongiosum also allows the corpus to become less rigid during erection. Hence, the distal extension of the spongiosum, the glans penis, covers the tips of the corpora cavernosa to provide a cushioning effect. The urethral meatus is positioned just slightly on the ventral surface of the glans and is slitlike. The edge of the glans overhangs the shaft of the penis, forming a rim called the corona. The 3 erectile bodies are surrounded by deep penile (Buck) fascia, the dartos fascia, and the penile skin. The deep penile (Buck) fascia is a strong, deep, fascial layer that is immediately superficial to the tunica albuginea. It is continuous with the deep fascia of the muscles covering the crura and bulb of the penis, the ischiocavernosus and bulbospongiosus. On the dorsal aspect of the corpora cavernosa, the deep dorsal vein and paired dorsal arteries and branches of the dorsal nerves are contained within the deep penile (Buck) fascia. This fascia splits to surround the corpus spongiosum, and it extends into the perineum as the deep fascia of the ischiocavernosus and bulbospongiosus muscles. The deep penile (Buck) fascia encloses these muscles and each crus of the corpora cavernosa and the bulb of the corpus spongiosum, adhering these structures to the pubis, ischium, and the urogenital diaphragm. The penile skin is continuous with that of the lower abdominal wall. Distally, the penile skin is confluent with the smooth, hairless skin covering the glans. At the corona, it is folded on itself to form the prepuce (foreskin), which overlies the glans. The subcutaneous connective tissue of the penis and scrotum has abundant smooth muscle and is called the dartos fascia, which continues into the perineum and fuses with the superficial perineal (Colle) fascia. In the penis, the dartos fascia is loosely attached to the skin and deep penile (Buck) fascia and contains the superficial arteries, veins, and nerves of the penis.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/55/12755tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/56/12756tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/57/12757tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/58/12758tn.jpg"
        ]
    },
    "Peripheral Nervous System Anatomy": {
        "description": "The peripheral nervous system refers to parts of the nervous system outside the brain and spinal cord. It includes the cranial nerves, spinal nerves and their roots and branches, peripheral nerves, and neuromuscular junctions. The anterior horn cells, although technically part of the central nervous system (CNS), are sometimes discussed with the peripheral nervous system because they are part of the motor unit. In the peripheral nervous system, bundles of nerve ﬁbers or axons conduct information to and from the central nervous system. The autonomic nervous system is the part of the nervous system concerned with the innervation of involuntary structures, such as the heart, smooth muscle, and glands within the body. It is distributed throughout the central and peripheral nervous systems. An image depicting the peripheral nervous system can be seen below. Nerve cells are called neurones. A neurone consists of a cell body (with a nucleus and cytoplasm), dendrites that carry electrical impulses to the cell, and a long axon that carries the impulses away from the cell. The axon of one neurone and the dendrites of the next neurone do not actually touch. The gap between neurones is called the synapse. Neuronal function is complex and involves numerous processes in nerve transmission. Generation of a nerve impulse (action potential) of a sensory neurone occurs as a result of a stimulus such as light, a particular chemical, or stretching of a cell membrane by sound. Conduction of an impulse along a neurone occurs from the dendrites to the cell body to the axon. Transmission of a signal to another neuron across a synapse occurs via chemical transmitter. This substance causes the next neurone to be electrically stimulated and keeps the signal going along a nerve. Ganglia may be divided into sensory ganglia of spinal nerves (spinal or posterior root ganglia) and cranial nerves and autonomic ganglia. Sensory ganglia of spinal nerves are fusiform swellings situated on the posterior root of each spinal nerve just proximal to the root’s junction with a corresponding anterior root. They are referred to as spinal or posterior root ganglia. Similar ganglia that are also found along the course of cranial nerves V, VII, VIII, IX, and X are called sensory ganglia of these nerve. Autonomic ganglia, which are often irregular in shape, are situated along the course of efferent nerve fibers of the autonomic nervous system. They are found in the paravertebral sympathetic chains, around the roots of the great visceral arteries in the abdomen, and close to, or embedded within, the walls of various viscera.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/45/291045tn.jpg"
        ]
    },
    "Pharynx Anatomy": {
        "description": "The pharynx is a fibromuscular tube that is semicircular in cross section and is situated directly anterior to the vertebral column. It extends from the skull base to the lower border of the cricoid cartilage. Six muscles are predominantly responsible for the voluntary actions of the pharynx: three pharyngeal constrictor muscles that are roughly circularly layered on top of one another and three vertically oriented muscles (stylopharyngeus, salpingopharyngeus, and palatopharyngeus). These muscles aid in the act of swallowing.\n [1] The pharynx serves as a continuation of the digestive cavity, providing a route from the oral cavity proper to the esophagus. In addition, the pharynx communicates with the nasal cavity, the middle ear cavity, and the larynx. The pharynx is often described from an exterior view and an interior perspective. Based on the location, the interior of the pharynx is often separated into three sections—the nasopharynx, oropharynx, and laryngopharynx.\n [2] The video below shows a view of the pharynx through the mouth.",
        "image_urls": []
    },
    "Pineal Gland Anatomy": {
        "description": "The principal aspect of the pineal gland anatomy is the pineal parenchymal cell, or pinocyte. The pineal gland develops during the second month of gestation as a diverticulum in the diencephalic roof of the third ventricle. It is flanked by the posterior and habenular commissures in the rostral portion of the midbrain directly below the splenium of the corpus callosum. The velum interpositum is found rostral and dorsal to the pineal gland and contains the internal cerebral veins, which join to form the great cerebral vein (of Galen).\n [1] The anatomy of the pineal gland, along with the pituitary gland, is displayed in the image below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/28/12728tn.jpg"
        ]
    },
    "Pituitary Gland Anatomy": {
        "description": "The pituitary gland is a pea-sized endocrine gland that sits at the base of the brain. Often referred to as the “master gland”, the pituitary gland synthesizes and releases various hormones that affect several organs throughout the body (see the images below). The pituitary gland is entirely ectodermal in origin but is composed of 2 functionally distinct structures that differ in embryologic development and anatomy: the adenohypophysis (anterior pituitary) and the neurohypophysis (posterior pituitary). The adenohypophysis develops from Rathke’s pouch, which is an upward invagination of oral ectoderm from the roof of the stomodeum; in contrast, the neurohypophysis develops from the infundibulum, which is a downward extension of neural ectoderm from the floor of the diencephalon (see the image below). The oral ectoderm and neural ectoderm that form the pituitary anlagen are in close contact during early embryogenesis, and this connection is critical for pituitary development.\n [2, 3] Over several weeks, Rathke’s pouch undergoes constriction at its base until it completely separates from the oral epithelium and nears its final position as the adenohypophysis.\n [4] The transition from Rathke’s pouch to the adenohypophysis involves the formation of the pars distalis from the rapidly proliferating anterior wall, the pars intermedia from the less active posterior wall, and the pars tuberalis from an upward outgrowth of the anterior wall. The incomplete obliteration of Rathke’s pouch can lead to remnants that form Rathke’s cleft cysts. The neurohypophysis develops from the differentiation of neural ectoderm into the pars nervosa, the infundibular stem, and the median eminence. The infundibular stem is surrounded by the pars tuberalis.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/05/12105tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/06/12106tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/07/12107tn.jpg"
        ]
    },
    "Prostate Anatomy": {
        "description": "Embryologically, the prostate, seminal vesicles, and ductus (vas) deferens originate from 2 separate structures. The prostate arises from a budding collection of tissue in the urogenital sinus. The seminal vesicles and the ductus deferens are formed from the mesonephric duct. The prostate develops from epithelial outgrowths form the prostatic segment of the urethra that grows into the surrounding mesenchyme. This outgrowth and branching start at week 10 during embryo growth; by week 12, there are 5 groups of tubules that form the lobes of the prostate. The first group makes up the middle lobe; the second and third groups make up the right and left lateral lobes; the fourth group is the posterior lobe that starts from the floor of the urethra; and the fifth group is the anterior lobe. The following image depicts the posterior view of the prostate gland.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/85/12385tn.jpg"
        ]
    },
    "Pulmonic Valve Anatomy": {
        "description": "The pulmonic valve divides the right ventricular outflow tract from the pulmonary artery. In normal conditions, the pulmonic valve prevents regurgitation of deoxygenated blood from the pulmonary artery back to the right ventricle. It is a semilunar valve with 3 cusps, and it is located anterior, superior, and slightly to the left of the aortic valve. An image depicting the pulmonary valve can be seen below. Like the aortic valve, the pulmonic valve is formed by 3 cusps, each with a fibrous node at the midpoint of the free edges (similar to the nodes of Aranti in the aortic valve) as well as lunulae, which are the thin, crescent-shaped portions of the cusps that serve as the coaptive surfaces of the valve. In contrast with the aortic valve, the cusps of the pulmonic valve are supported by freestanding musculature with no direct relationship with the muscular septum; its cusps are much thinner and lack a fibrous continuity with the anterior leaflet of the right atrioventricular (AV) valve (tricuspid valve).\n [1, 2, 3, 4] The cusps of the pulmonic valve are defined by their relationship to the aortic valve and are thus termed anterior or nonseptal, right and left cusps. They can also be defined by their relationship to a commissure found in the pulmonic and aortic valves and hence termed right adjacent (right facing), left adjacent (left facing), and opposite (nonfacing). The pulmonic valve, like the other 3 cardiac valves, is formed by endocardial folds that are supported by internal plates of dense collagenous and elastic connective tissue and are continuous with the cardiac skeleton.\n [5]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/86/12386tn.jpg"
        ]
    },
    "Regions and Planes of the Abdomen": {
        "description": "The anatomy of the regions and planes of the abdomen is composed of many layers with varying blood supply and innervation. The abdomen has been bisected, trisected, and even divided into as many as 9 separate regions. The layers of the abdominal wall consist of the skin, superficial fascia, and muscles. The anatomic planes of the abdominal wall are made up of multiple muscular and fascial layers that interdigitate and unite to form a sturdy, protective musculofascial layer that protects the visceral organs and provides strength and stability to the body's trunk. This anatomy varies with respect to the different topographic regions of the abdomen; thus, a firm understanding of these layers, their blood supply, and their innervation is essential to surgical management of the abdomen. The abdominal cavity is the largest hollow space in the body. It is bound cranially by the xiphoid process of the sternum and the costal cartilages of ribs 7-10; caudally, by the anterior ilium and the pubic bone of the pelvis; anteriorly, by the abdominal wall musculature; and posteriorly, by the L1-L5 vertebrae. The abdominal wall has few anatomic landmarks. The flat abdominal plane is broken up only by the costal margins, anterior superior iliac spines, and the umbilicus. Thus, many attempts have been made over the years to describe what surface anatomy cannot. The most common and widely accepted system for identification of the various regions of the abdomen is the simple division of the abdomen into 4 quadrants by a vertical and horizontal line bisecting the umbilicus and forming the right and left upper and lower quadrants (see the image below).\n [1]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/87/12387tn.jpg"
        ]
    },
    "Retina Anatomy": {
        "description": "The retina is the light-sensitive tissue that lines the inside of the eye. The retina functions in a manner similar to film in a camera. The optical elements within the eye focus an image onto the retina of the eye, initiating a series of chemical and electrical events within the retina. Nerve fibers within the retina send electrical signals to the brain, which then interprets these signals as visual images.\n [1]",
        "image_urls": []
    },
    "Sacral Plexus Anatomy": {
        "description": "The sacral plexus (plexus sacralis) is a nerve plexus that provides motor and sensory nerves for the posterior thigh, most of the lower leg, the entire foot, and part of the pelvis (see the following image). It is part of the larger lumbosacral plexus. The sacral plexus is derived from the anterior rami of spinal nerves L4, L5, S1, S2, S3, and S4. Each of these anterior rami gives rise to anterior and posterior branches. The anterior branches supply flexor muscles of the lower limb, and posterior branches supply the extensor and abductor muscles.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/10/12110tn.jpg"
        ]
    },
    "Scalp Anatomy": {
        "description": "The soft tissue envelope of the cranial vault is called the scalp. The scalp extends from the external occipital protuberance and superior nuchal lines to the supraorbital margins. The scalp consists of 5 layers (seen in the image below): the skin, connective tissue, epicranial aponeurosis, loose areolar tissue, and pericranium. The first 3 layers are bound together as a single unit. This single unit can move along the loose areolar tissue over the pericranium, which is adherent to the calvaria.\n [1, 2, 3, 4] The skin of the scalp is thick and hair bearing and contains numerous sebaceous glands. As a result, the scalp is a common site for sebaceous cysts. The superficial fascia is a fibrofatty layer that connects skin to the underlying aponeurosis of the occipitofrontalis muscle and provides a passageway for nerves and blood vessels. Blood vessels are attached to this fibrous connective tissue. If the vessels are cut, this attachment prevents vasospasm, which could lead to profuse bleeding after injury. The epicranial aponeurosis is a thin, tendinous structure that provides an insertion site for the occipitofrontalis muscle. Posterolaterally, the epicranial aponeurosis attachment extends from the superior nuchal line to the superior temporal line. Laterally, the epicranial aponeurosis continues as the temporal fascia. Anteriorly, the subaponeurotic space extends to the upper eyelids due to the lack of a bony insertion. This loose areolar tissue provides a potential subaponeurotic space that allows fluids and blood to pass from the scalp to the upper eyelids. Areolar tissue loosely connects the epicranial aponeurosis to the pericranium and allows the superficial 3 layers of the scalp to move over the pericranium. Scalp flaps are elevated along a relatively avascular plane in craniofacial and neurosurgical procedures. However, certain emissary veins traverse this layer, which connects the scalp veins to the diploic veins and intracranial venous sinuses. The pericranium is the periosteum of the skull bones. Along the suture lines, the pericranium becomes continuous with the endosteum. A subperiosteal hematoma, therefore, forms in the shape of the skull bones. The occipitofrontalis muscle consists of 2 occipital bellies and 2 frontal bellies. The occipital bellies arise from the superior nuchal lines on the occipital bone. The frontal bellies originate from the skin and superficial fascia of the upper eyelids. The occipital and frontal bellies insert into the epicranial aponeurosis. Each occipital belly is innervated by the posterior auricular branch of the facial nerve, and each frontal belly is innervated by the frontal branch of the facial nerve. The frontal bellies can raise the eyebrows.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/47/24447tn.jpg"
        ]
    },
    "Seminal Vesicle Anatomy": {
        "description": "The seminal vesicles are paired organs of the male genitourinary system. Specifically, they are genital organs. The male genital organs include the penis, testes, excretory genital ducts, ductus deferens, seminal vesicles, prostate, and bulbourethral glands. Of these organs, the seminal vesicles, prostate, and bulbourethral glands are considered accessory glandular structures. These organs work together to produce and excrete semen (\"seed\" in Latin), which is composed of mature spermatozoa residing in a thickened, mucous fluid. The spermatozoa are produced by the testes, and they travel to the urethra by means of the ductus deferens. Along this route, the genital ducts and accessory glandular structures produce mucous secretions that combine with the spermatozoa to create semen. Smooth muscular contractions then propel the semen through the urethra and into the female reproductive tract by means of the penis. The following image depicts the seminal vesicles, ejaculatory ducts, and the prostate. Manual examination of the seminal vesicles can be attempted via palpation with the index finger in the rectal vault and the fingerpad directed anteriorly. The seminal vesicles lie immediately superior to the prostate gland at the base of the bladder and flare out laterally as one palpates in an inferior to superior direction. Although the prostate gland can be readily felt, the seminal vesicles are not normally palpable. However, in the instance of chronic infection (such as tuberculosis) or advanced cancer of the prostate, the glands may feel indurated.\n [1] Cystic masses of the seminal vesicles may also be felt on palpation and are typically embryologic remnants of the paramesonephric ducts. Primary carcinoma of the seminal vesicles is very rare.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/54/12754tn.jpg"
        ]
    },
    "Shoulder Joint Anatomy": {
        "description": "The human shoulder is the most mobile joint in the body.\n [1] This mobility provides the upper extremity with tremendous range of motion such as adduction, abduction, flexion, extension, internal rotation, external rotation, and 360° circumduction in the sagittal plane. Furthermore, the shoulder allows for scapular protraction, retraction, elevation, and depression. This wide range of motion also makes the shoulder joint unstable.\n [1] This instability is compensated for by rotator cuff muscles, tendons, ligaments, and the glenoid labrum.\n [2, 3, 4, 5, 6] An image depicting shoulder anatomy can be seen below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/15/12115tn.jpg"
        ]
    },
    "Skeletal Muscle - Structure and Histology": {
        "description": "This article describes the structure, histologic features, and ultrastructural features of normal adult human skeletal muscle and addresses the results of improper specimen handling during muscle biopsy. Many of the images show the normal microscopic appearance of muscle biopsy specimens, with some of the histological stains that are routinely used in the evaluation of muscle biopsies. Some of the captions mention abnormalities that can be seen with those stains to provide some insight into their practical applications in biopsy diagnosis of neuromuscular disease. This article provides introductory background information that should assist the reader in understanding pathologic findings in muscle the various disorders that are presented in a separate article. The intended audience is any physician who deals with patients with primary neuromuscular disease or neuromuscular complications of systemic disease and who considers obtaining or performing a muscle biopsy for diagnosis. This includes primary care physicians, pediatricians, rheumatologists, neurologists, dermatologists, oncologists, radiologists, and surgeons. These physicians should use this article as the foundation for comparing normal muscle to what is found in the setting of disease and to learn about appropriate care and handling of skeletal muscle biopsy tissue. This article can assist physicians who read muscle biopsy reports written by others to comprehend the significance of pathological findings described in muscle biopsies by seeing how pathological findings differ from normal skeletal muscle. This article should be useful to those beginning their training in interpretation of muscle biopsies and can serve as a resource for medical students who are learning about muscle structure and function and are being introduced to neuromuscular disorders. For a detailed discussion of muscle biopsy procedure and an overview of the clinical and laboratory features of neuromuscular disease, see Muscle Biopsy and Clinical and Laboratory Features of Neuromuscular Disease.\n [1] For details on the pathological findings in muscle biopsy in several major categories of neuromuscular disease, see Skeletal Muscle Pathology.\n [2] A layer of dense connective tissue, which is known as epimysium, surrounds each muscle (see the image below).  The epimysium is continuous with the tendon of a muscle.  A muscle is composed of numerous bundles of muscle fibers, termed fascicles, which are separated from each other by a connective tissue layer termed perimysium. Endomysium is the connective tissue that separates individual muscle fibers from each other. Mature muscle cells are termed muscle fibers or myofibers and they are often simply referred to as fibers. Each myofiber is a multinucleate syncytium formed by fusion of precursor skeletal muscle cells termed myoblasts. Sarcoplasm, the cytoplasm of each myofiber, is occupied largely by the contractile apparatus of the cell. This is composed of myofibrils arranged in sarcomeres, which are the contractile units of the cell. The sarcomeres contain a number of proteins, among them are alpha actinin, which is the major constituent of the Z-band, and actin and myosin, which are the major components of the thin and thick filaments, respectively. The remainder of the sarcoplasm, located between the myofibrils, is termed the intermyofibrillar network and contains mitochondria, lipid, glycogen, T-tubules, and sarcoplasmic reticulum. T-tubules are responsible for conduction of electrical signals from the cell surface to the internal areas of myofibers.  The sarcoplasmic reticulum provides the intracellular storage and release of calcium required for contraction to occur. The electrical signals conducted by the T-tubules stimulate the sarcoplasmic reticulum to release calcium. This calcium then binds to troponin, one of the proteins associated with the thin actin filaments; through a series of a few steps, this results in the binding of the thick filaments to the thin filaments. The binding of the myosin head to the actin filaments, together with the concomitant hydrolysis of ATP for energy, results in the contraction of the sarcomeres that in turn causes contraction of the entire muscle, resulting in movement (or the development of isometric tension that permits us to hold objects or resist being pulled). The connective tissue of the muscle plays an important role in the transmission of the forces generated by contraction of the sarcomeres to produce movement or isometric tension.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/93/12393tn.jpg"
        ]
    },
    "Skeletal System Anatomy in Adults": {
        "description": "The skeleton of the human being is a unique structure that has adapted to the needs of bipedal locomotion and erect posture. The structural peculiarities of the human skeleton give human beings their characteristic appearance and facial geometry. The bony skeleton provides the shape and framework on which the human body is designed and functions. It houses and protects vital organs; it contains bone marrow, which is the functional unit of the hematopoietic system; and it provides attachments and anchorage to muscles and ligaments and joint capsules. Bones often act as levers, which, in conjunction with muscular contraction, initiate and sustain movement. This article provides an overview of the basic anatomy of the human skeleton, bones, and joints (see the image below).",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/32/12132tn.jpg"
        ]
    },
    "Skeletal System Anatomy in Children and Toddlers": {
        "description": "As Mercer Rang has correctly pointed out, \"Children are not young adults.\" Children differ significantly from adults with respect to skeletal anatomy and physiology. Differences in bone growth and modeling, as well as remodeling, affect the way in which conditions involving the skeleton should be viewed and managed.",
        "image_urls": []
    },
    "Skin Anatomy": {
        "description": "The skin covers the entire external surface of the human body and is the principal site of interaction with the surrounding world. It serves as a protective barrier that prevents internal tissues from exposure to trauma, ultraviolet (UV) radiation, temperature extremes, toxins, and bacteria. Other important functions include sensory perception, immunologic surveillance, thermoregulation, and control of insensible fluid loss. The integument consists of 2 mutually dependent layers, the epidermis and dermis, which rest on a fatty subcutaneous layer, the panniculus adiposus. The epidermis is derived primarily from surface ectoderm but is colonized by pigment-containing melanocytes of neural crest origin, antigen-processing Langerhans cells of bone marrow origin, and pressure-sensing Merkel cells of neural crest origin. The dermis is derived primarily from mesoderm and contains collagen, elastic fibers, blood vessels, sensory structures, and fibroblasts.\n [1]  See the image below. During the fourth week of embryologic development, the single cell thick ectoderm and underlying mesoderm begin to proliferate and differentiate. The specialized structures formed by the skin, including teeth, hair, hair follicles, fingernails, toenails, sebaceous glands, sweat glands, apocrine glands, and mammary glands also begin to appear during this period in development. Teeth, hair, and hair follicles are formed by the epidermis and dermis in concert, while fingernails and toenails are formed by the epidermis alone. Hair follicles, sebaceous glands, sweat glands, apocrine glands, and mammary glands are considered epidermal glands or epidermal appendages, because they develop as downgrowths or diverticula of the epidermis into the dermis.\n [1, 2] The definitive multi-layered skin is present at birth, but skin is a dynamic organ that undergoes continuous changes throughout life as outer layers are shed and replaced by inner layers. Skin also varies in thickness among anatomic location, sex, and age of the individual. This varying thickness primarily represents a difference in dermal thickness, as epidermal thickness is rather constant throughout life and from one anatomic location to another. Skin is thickest on the palms and soles of the feet (1.5 mm thick), while the thinnest skin is found on the eyelids and in the postauricular region (0.05 mm thick). Male skin is characteristically thicker than female skin in all anatomic locations. Children have relatively thin skin, which progressively thickens until the fourth or fifth decade of life when it begins to thin. This thinning is also primarily a dermal change, with loss of elastic fibers, epithelial appendages, and ground substance.\n [3]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/48/8348tn.jpg"
        ]
    },
    "Skull Base Anatomy": {
        "description": "The skull base forms the floor of the cranial cavity and separates the brain from other facial structures. This anatomic region is complex and poses surgical challenges for otolaryngologists and neurosurgeons alike. Working knowledge of the normal and variant anatomy of the skull base is essential for effective surgical treatment of disease in this area. The 5 bones that make up the skull base are the ethmoid, sphenoid, occipital, paired frontal, and paired temporal bones. The skull base can be subdivided into 3 regions: the anterior, middle, and posterior cranial fossae. (See the image below.) The petro-occipital fissure subdivides the middle cranial fossa into 1 central component and 2 lateral components. This article discusses each region, with attention to the surrounding structures, nerves, vascular supply, and clinically relevant surgical landmarks.\n [1, 2, 3, 4, 5, 6, 7, 8, 9]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/64/25164tn.jpg"
        ]
    },
    "Sling Procedures for Male Incontinence": {
        "description": "The male urethral sling is an important treatment for addressing male incontinence from multiple causes and unlike the artificial urinary sphincter (AUS), the sling requires no manual dexterity, no significant mechanical parts, and no patient training.\n [1] Currently, Coloplast’s Virtue sling (utilizes four arm approach versus two)\n [2] and Boston Scientific’s AdVance Male Sling System\n [3] are two available options for male urethral slings. The InVance bone anchored sling (a product of former company American Medical Systems) has fallen out of favor due to risk of osteomyelitis.\n [4] The Argus slings from the international company Promedon have also been used in the past.\n [5] Data presented reflect all three slings as described above.",
        "image_urls": []
    },
    "Small Intestine Anatomy": {
        "description": "The small intestine (small bowel) lies between the stomach and the large intestine (large bowel) and includes the duodenum, jejunum, and ileum. The small intestine is so called because its lumen diameter is smaller than that of the large intestine, although it is longer in length than the large intestine. The duodenum continues into the jejunum at the duodenojejunal junction or flexure, which lies to the left of L2 vertebra and is fixed to the retroperitoneum by a suspensory ligament of Treitz. The inferior mesenteric vein (IMV) lies to the left of the duodenojejunal junction. There are several peritoneal fossae around the duodenojejunal flexure, which may be the sites of an internal herniation of the small bowel. The rest of the small intestine is a 4-6-m long convoluted tube occupying the center of the abdomen and the pelvis, surrounded on 2 sides and above by the colon (a part of the large intestine). The ileum continues into the large intestine (cecum) at the ileocecal junction.\n [1, 2, 3, 4, 5] The digestive tract anatomy is depicted in the image below. The small intestine is differentiated from the large intestine by the presence of a mesentery (exceptions being no mesentery in the duodenum, and presence of a mesentery in the transverse and sigmoid colons) and the absence of tenia coli and appendices epiploicae, which are present in the colon. The demarcation between the jejunum (proximal) and the ileum (distal) is not very clear. Embryologically, the small intestine develops mainly from the midgut, with the superior mesenteric artery (SMA) as its artery. The midgut also gives rise to the proximal large intestine (up to the proximal two thirds of the transverse colon). The proximal part of the duodenum (between the pylorus and major duodenal papilla) develops from the caudal foregut. The site of the major duodenal papilla on the medial wall of the second part of the duodenum marks the junction of embryological foregut and midgut. At an early stage of development, the midgut communicates with the yolk sac via a vitellointestinal (omphalomesenteric) duct, which disappears later. The duodenum has 4 parts: superior, descending, horizontal, and ascending. The first (superior) part, or bulb (5 cm), is connected to the undersurface of the liver (porta hepatis) by the hepatoduodenal ligament (HDL), which contains the proper hepatic artery, portal vein, and common bile duct (CBD); the quadrate lobe of the liver and gallbladder are in front, and the CBD), portal vein, and gastroduodenal artery (GDA) are behind. The second (descending) part, or C loop (10 cm), which has an upper and a lower genu (flexure), is related to the transverse mesocolon and colon in front and the right kidney and inferior vena cava (IVC) behind; the head of the pancreas lies in the concavity of the duodenal C. The third (horizontal) part (7.5 cm) runs from right to left in front of the inferior vena cava (IVC) and aorta, with the superior mesenteric vessels (the vein on the right and the artery on the left) in front. The fourth (ascending) part (2.5 cm) continues as the jejunum. The duodenum continues into the jejunum at the duodenojejunal flexure. The jejunum constitutes about two fifths of the proximal small intestine and the ileum makes the distal three fifths. No clear demarcation is noted between the jejunum and ileum; however, there are some features which distinguish the jejunum from the ileum. The jejunum has a thicker wall and a wider lumen than the ileum and mainly occupies the left upper and central abdomen. Mesenetric fat is less abundant in the mesentery of the jejunum and vessels in the mesentery are, therefore, well seen. The ileum constitutes about three fifths of the distal small intestine and the jejunum makes the proximal two fifths. No clear demarcation is noted between the ileum and jejunum; however, there are some features which distinguish the ileum from the jejunum. The ileum has a thinner wall and a smaller lumen than the jejunum and mainly occupies the central and right lower abdomen and pelvis. Mesenteric fat is abundant in the mesentery of the ileum and vessels in the mesentery are, therefore, not well seen. (In cystic fibrosis, the jejunum is where the mesentery vessels are well seen because much less mesenteric fat is present in the jejunum than in the ileum.) The mesentery is a double fold of peritoneum attached to the posterior abdominal wall. It is fan-shaped with a root of about 15 cm extending obliquely from the left L2 transverse process level to the right sacroiliac joint and crossing the third part of the duodenum, aorta and inferior vena cava (IVC) and right ureter, and a 4- to 6-m periphery, which covers the entire length of the jejunum and ileum. Between the 2 leaves of the mesentery are the mesenteric vessels and lymph nodes.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/07/12707tn.jpg"
        ]
    },
    "Somatosensory System Anatomy": {
        "description": "The somatosensory system is the part of the sensory system concerned with the conscious perception of touch, pressure, pain, temperature, position, movement, and vibration, which arise from the muscles, joints, skin, and fascia. The somatosensory system is a 3-neuron system that relays sensations detected in the periphery and conveys them via pathways through the spinal cord, brainstem, and thalamic relay nuclei to the sensory cortex in the parietal lobe.\n [1] Impulses are carried from receptors via sensory afferents to the dorsal root ganglia, where the cell bodies of the first-order neurons are located. Their axons then travel through the spinal cord either in an ipsilateral or a contralateral fashion. Note that second-order neuron cell bodies are located in different anatomical areas depending on the sensation they carry. Broadly, the spinal cord contains the second-order neurons for the fibers carrying pain, touch, and temperature sensations. The medulla contains the second-order neurons for fibers carrying touch, position, and vibratory sensations. The fibers are then either conveyed to the thalamus (where the third-order neurons are located) or conveyed to the cerebellum. The latter tracts are not discussed in this article in detail because they carry information that is not perceived consciously. From the thalamic nucleus, the sensory afferents are projected to the cortical sensory areas, where information is integrated and analyzed.\n [2, 3, 4] The somatosensory system is displayed in the images below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/14/12614tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/15/12615tn.jpg"
        ]
    },
    "Spleen Anatomy": {
        "description": "The spleen is an organ shaped like a shoe that lies relative to the 9th and 11th ribs and is located in the left hypochondrium and partly in the epigastrium. Thus, the spleen is situated between the fundus of the stomach and the diaphragm. The spleen is very vascular and reddish purple in color; its size and weight vary. A healthy spleen is not palpable. The spleen develops in the cephalic part of dorsal mesogastrium (from its left layer; during the sixth week of intrauterine life) into a number of nodules that fuse and form a lobulated spleen. Notching of the superior border of the adult spleen is evidence of its multiple origin (see the image below).\n [1]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/75/12675tn.jpg"
        ]
    },
    "Stomach Anatomy": {
        "description": "The stomach is the first intra-abdominal part of the gastrointestinal (GI), or digestive, tract. It is a muscular, highly vascular bag-shaped organ that is distensible and may take varying shapes, depending on the build and posture of the person and the state of fullness of the organ (see the image below). The stomach lies in the left upper quadrant of the abdomen.\n [1, 2]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/46/12146tn.jpg"
        ]
    },
    "Suprarenal (Adrenal) Gland Anatomy": {
        "description": "The suprarenal glands, also known as adrenal glands, belong to the endocrine system. They are a pair of triangular-shaped glands, each about 2 in long and 1 in wide, that sit on top of the kidneys (see the image below). The suprarenal glands are responsible for the release of hormones that regulate metabolism, immune system function, and the salt-water balance in the bloodstream; they also aid in the body’s response to stress.\n [1]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/10/12010tn.jpg"
        ]
    },
    "Taste System Anatomy": {
        "description": "Taste is a chemical sense. The sensory experience is produced by stimulation of specific receptors in the oral cavity. The gross anatomy (peripheral and central nervous system) of taste, microscopic and ultrastructural morphology of taste buds, physiology of taste (modalities, distribution of taste sensations, electrophysiology of the receptors, mechanism and intensity of stimulation, and taste contrasts), as well as a few clinical applications, are discussed in this article. The anatomy of the taste system is displayed in the image below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/02/12602tn.jpg"
        ]
    },
    "Testes and Epididymis Anatomy": {
        "description": "The testis (from the Greek word orchis) is the male gland important for both reproductive (exocrine) and endocrine functions.\n [1] Initially, it begins as an undifferentiated gonad in the retroperitoneal area. Transcription of the SRY gene (testis-determining factor region) on the Y chromosome ultimately leads to sex differentiation. Without the SRY gene, the gonad would develop into an ovary. As the fetus develops, the functioning testis produces the male hormone testosterone to allow development of male genitalia. Over the last 3 months' gestation, the testis must course its way down from its original retroperitoneal position to its final destination in the scrotum. During its journey, it must pass through the peritoneum, abdominal wall via the inguinal canal, and into the scrotal pouch. An image depicting the testes and epididymis can be seen below.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/49/12749tn.jpg"
        ]
    },
    "Thoracic Duct Anatomy": {
        "description": "Thoracic duct anatomy must be understood in the context of its embryology. The anlage of the thoracic duct appears in the sixth to seventh week of fetal life as lymphatic clefts surrounded with mesenchyme near large veins. Connecting with each other, the clefts form the jugular and retroperitoneal lymph sacs and a well branching network of canals. Further development of the thoracic duct is connected with the lymph nodes formation; their germs appear on the 9th-10th week along the course of the left trunk, as well as along the ductal branches and anastomoses. The formation of the lymph nodes results in reduction of some trunks and plexuses of the thoracic duct. Disturbances in the formation processes of the lymph nodes can result in various structural variants of the thoracic duct in children and adults. The thoracic duct wall and the lymph nodes formation are not completed by birth.\n [1, 2, 3] The first lymph sacs to develop are the paired jugular lymph sacs at the junction of the internal jugular and subclavian veins. The jugular lymph sacs communicate inferiorly with the single retroperitoneal lymph sac at the root of the mesentery of the intestine and with the cisterna chyli, a lymph sac below the developing diaphragm on the posterior abdominal wall. The retroperitoneal lymph sac develops from mesonephric (primitive kidney) veins and the primitive vena cava. Capillary plexuses and lymphatics expand from the retroperitoneal lymph sac to the abdominal viscera and diaphragm. Channels that join the jugular lymph sacs to the cisterna chyli become the thoracic duct (or left lymphatic duct) and the right lymphatic duct. The retroperitoneal sac establishes connections with the cisterna chyli but loses its connections with the nearby veins. The cisterna chyli loses its connections with the surrounding veins but produces the inferior portion of the thoracic duct. The primitive lymph sacs become united by longitudinal connections, and each sac associates with lymphatic vessels that drain specific areas. New vessels sprout from the primitive lymphatic system and extend to most tissues of the body, mostly along the course of the main veins. Lymphatics never occur in the central nervous system, meninges, eyeball and cornea, inner ear, cartilage, epidermis, and spleen. Eventually, lymphatic vessels replace the lymph sacs.",
        "image_urls": []
    },
    "Throat Anatomy": {
        "description": "The throat (see the image below) is part of both the digestive and respiratory systems and is responsible for coordinating the functions of breathing and swallowing. From superior to inferior, the throat is subdivided into 3 sections: oropharynx, hypopharynx, and larynx. Together, the oropharynx, hypopharynx, and larynx function to sense and propel a food bolus from the mouth to the esophagus in a coordinated fashion while protecting the airway.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/47/12147tn.jpg"
        ]
    },
    "Thyroid Anatomy": {
        "description": "The thyroid is a highly vascular, brownish-red gland located anteriorly in the lower neck, extending from the level of the fifth cervical vertebra down to the first thoracic. The gland varies from an H to a U shape and is formed by 2 elongated lateral lobes with superior and inferior poles connected by a median isthmus, with an average height of 12-15 mm, overlying the second to fourth tracheal rings. (See the image below.) The isthmus is encountered during routine tracheotomy and must be retracted (superiorly or inferiorly) or divided. Occasionally, the isthmus is absent, and the gland exists as 2 distinct lobes. The video below depicts an ultrasonographic view of the right lobe of the thyroid gland.\n [1, 2] Each lobe is 50-60 mm long, with the superior poles diverging laterally at the level of the oblique lines on the laminae of the thyroid cartilage. (The video below depicts an ultrasonographic view of the right lobe of the thyroid gland.) The lower poles diverge laterally at the level of the fifth tracheal cartilage. Although thyroid weight varies, it averages 25-30 g in adults (it is slightly heavier in women). The gland enlarges during menstruation and pregnancy. A conical pyramidal lobe often ascends from the isthmus or the adjacent part of either lobe (more often the left) toward the hyoid bone, to which it may be attached by a fibrous or fibromuscular band, the levator of the thyroid gland. Remnants of the thyroglossal duct may persist as accessory nodules or cysts of thyroid tissue between the isthmus and the foramen caecum of the tongue base. Usually, 2 pairs of parathyroid glands lie in proximity to the thyroid gland. (See also Embryology of the Thyroid and Parathyroids.) Principal innervation of the thyroid gland derives from the autonomic nervous system. Parasympathetic fibers come from the vagus nerves, and sympathetic fibers are distributed from the superior, middle, and inferior ganglia of the sympathetic trunk. These small nerves enter the gland along with the blood vessels. Autonomic nervous regulation of the glandular secretion is not clearly understood, but most of the effect is postulated to be on blood vessels, hence the perfusion rates of the glands.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/89/24489tn.jpg"
        ]
    },
    "Tongue Anatomy": {
        "description": "The tongue is a mass of muscle that is almost completely covered by a mucous membrane. It occupies most of the oral cavity and oropharynx. It is known for its role in taste, but it also assists with mastication (chewing), deglutition (swallowing), articulation (speech), and oral cleansing. Five cranial nerves contribute to the complex innervation of this multifunctional organ. The embryologic origins of the tongue first appear at 4 weeks' gestation.\n [1] The body of the tongue forms from derivatives of the first branchial arch. This gives rise to 2 lateral lingual swellings and 1 median swelling (known as the tuberculum impar). The lateral lingual swellings slowly grow over the tuberculum impar and merge, forming the anterior two thirds of the tongue. Parts of the second, third, and fourth branchial arches give rise to the base of the tongue. Occipital somites give rise to myoblasts, which form the intrinsic tongue musculature.",
        "image_urls": []
    },
    "Tonsil and Adenoid Anatomy": {
        "description": "The palatine tonsils are dense compact bodies of lymphoid tissue that are located in the lateral wall of the oropharynx, bounded by the palatoglossus muscle anteriorly and the palatopharyngeus and superior constrictor muscles posteriorly and laterally.\n [1] The adenoid is a median mass of mucosa-associated lymphoid tissue. It is situated in the roof and posterior wall of the nasopharynx.\n [2] The adenoid was first described in 1868 by the Danish physician Meyer in his paper “Adenoid Vegetations in the Nasopharyngeal Cavity.”\n [3] Both tonsils and adenoid are part of the Waldeyer ring, which is a ring of lymphoid tissue found in the pharynx. The lymphoid tissue in this ring provides defense against pathogens. The Waldeyer ring is involved in the production of immunoglobulins and the development of both B cells and T cells.\n [1]",
        "image_urls": []
    },
    "Tooth Anatomy": {
        "description": "The tooth anatomy includes the crown, which is the portion of the tooth exposed to the oral cavity, and one or more roots, which are enveloped in bone and the periodontium. The crown of each tooth has 5 surfaces, as follows: Buccal (facing the cheek or lip) Lingual (facing the tongue) Mesial (between the teeth) Distal (between the teeth) Chewing (occlusal for molars and premolars, incisal for incisors and canines) In the transverse section, the tooth has 3 distinct layers, as follows: A surface enamel layer covering only the crown An inner layer of dentin in both the crown and the root The core area, known as the pulp, which contains nerves, arteries, and veins\n [1] Radiographically, the layers are easily identifiable because they have different radiopacities. Enamel is the most mineralized of the calcified tissues of the body, and it is the most radiopaque of the 3 tooth layers. Dentin is less radiopaque than enamel and has a radiopacity similar to that of bone. The pulp tissue is not mineralized and appears radiolucent.\n [2] The anatomy of the tooth is displayed in the image below. Primary (ie, deciduous) teeth number 20,\n [3] and secondary (ie, adult) teeth number 32. A phase of mixed dentition exists, depending on the age of the patient (typically, 6-14 y). This phase is associated with simultaneous exfoliation or the eruption of primary and secondary teeth (see Tables 1-2). Table 1. Calcification and Eruption Sequence of Primary Dentition (Open Table in a new window)  Primary Teeth Calcification Begins (Weeks In Utero) Enamel Completed (Months after Birth) Eruption (Months after Birth) Maxilla    Central incisor 13-16 1.5 8-12 Lateral incisor 14.5-16.5 2.5 8-13 Canine 15-18 9 16-22 First molar 14. 5-16.5 6 13-19 Second molar 16-23.5 11 25-33 Mandible    Central incisor 13-16 2.5 6-10 Lateral incisor 14.5-16.5 3 10-16 Canine 16-18 9 17-23 First molar 14.5-17 5.5 14-18 Second molar 17-19.5 10 23-31 Table 2. Calcification and Eruption Sequence of Secondary Dentition (Open Table in a new window)  Permanent Teeth Calcification Begins (Months) Eruption (Years) Maxilla   Central incisor 3-4 7-8 Lateral incisor 10-12 8-9 Canine 4-5 11-12 First premolar 8-21 10-11 Second premolar 24-27 10-12 First molar 0-1 5-6 Second molar 30-36 12-13 Mandible   Central incisor 3-4 6-7 Lateral incisor 3-4 7-8 Canine 4-5 9-10 First premolar 21-24 10-12 Second premolar 27-30 11-12 First molar 0-1 5-6 Second molar 30-36 12-13",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/16/12416tn.jpg"
        ]
    },
    "Topographic and Functional Anatomy of the Spinal Cord": {
        "description": "Spinal cord disease results from multiple diverse pathologic processes. Trauma is the most common cause of spinal cord injury. Depending on its pathogenesis, spinal cord disease can manifest with variable impairment of motor, sensory, or autonomic function. This review focuses on spinal cord anatomy. Basic clinical descriptions of common patterns of spinal cord involvement are related to essential aspects of spinal cord anatomy. The spinal cord is located inside the vertebral canal, which is formed by the foramina of 7 cervical, 12 thoracic, 5 lumbar, and 5 sacral vertebrae, which together form the spine. The spinal cord extends from the foramen magnum down to the level of the first and second lumbar vertebrae (at birth, down to second and third lumbar vertebrae). See the image below. The spinal cord is composed of the following 31 segments: 8 cervical (C) segments 12 thoracic (T) segments 5 lumbar (L) segments 5 sacral (S) segments 1 coccygeal (Co) segment - mainly vestigial The spinal nerves consist of the sensory nerve roots, which enter the spinal cord at each level, and the motor roots, which emerge from the cord at each level. The spinal nerves are named and numbered according to the site of their emergence from the vertebral canal. C1-7 nerves emerge above their respective vertebrae. C8 emerges between the seventh cervical and first thoracic vertebrae. The remaining nerves emerge below their respective vertebrae. See the image below. The dorsal rami of C1-4 are located in the suboccipital region. C1 participates in the innervation of neck muscles, including the semispinalis capitis muscle. C2 carries sensation from the back of the head and scalp, along with motor innervation to several muscles in the neck. C3-C5 contribute to the formation of the phrenic nerve and innervate the diaphragm. C5-T1 provide motor control for the upper extremities and related muscles. The thoracic cord has 12 segments and provides motor control to the thoracoabdominal musculature. The lumbar and sacral portions of the cord have 5 segments each. L2-S2 provide motor control to lower extremities and related muscles. The conus medullaris is the cone-shaped termination of the caudal cord. The pia mater continues caudally as the filum terminale through the dural sac and attaches to the coccyx. The coccyx has only 1 spinal segment. The cauda equina (Latin for horse tail) is the collection of lumbar and sacral spinal nerve roots that travel caudally prior to exiting at their respective intervertebral foramina. The cord ends at vertebral levels L1-L2.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/13/7013tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/14/7014tn.jpg"
        ]
    },
    "Trachea Anatomy": {
        "description": "This discussion of tracheal anatomy covers the following aspects: Development of the Human Trachea: Highlights of the different periods of embryonic and fetal development Gross anatomy: The structure, dimensions, and anatomic relationships, as well as the neurovascular and lymphatic supply of the upper airway; differences between the child and adult tracheas Microscopic anatomy and a few ultrastructural points pertinent to the function of the cartilaginous framework of the trachea Clinical correlations related to tracheal anomalies, tracheal deviation, or shift as well as artificial trachea",
        "image_urls": []
    },
    "Tricuspid Valve Anatomy": {
        "description": "The right atrioventricular valve complex (the tricuspid valve) is made up of the 3 valve leaflets, the annulus, the supporting chordae tendineae, and the papillary muscles. The atrial and ventricular masses, conduction system tissue, and support structure of the fibroelastic cardiac skeleton allow coordinated actions of the tricuspid valve.\n [1] See the following images. The tricuspid valve is often called the \"forgotten valve\" or \"lost valve,\" because it is understudied relative to the other cardiac valves; variations in anatomic structures have been reported in the literature. The tricuspid valve has been described as having as few as 2 and as many as 6 leaflets,\n [2] whereas the papillary muscles have been reported to number from 2 to 9.\n [3]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/17/12417tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/18/12418tn.jpg"
        ]
    },
    "Trigeminal Nerve Anatomy": {
        "description": "The trigeminal nerve is the largest and most complex of the 12 cranial nerves (CNs). It supplies sensations to the face, mucous membranes, and other structures of the head. It is the motor nerve for the muscles of mastication and contains proprioceptive fibers. It exits the brain by a large sensory root and a smaller motor root coming out of the pons at its junction with the middle cerebral peduncle. It passes laterally to join the gasserian (semilunar) ganglion in the Meckel cave. (See the image below.) The sensory nucleus, located in the pons, is quite extensive. It receives ordinary sensations from the main 3 branches of the trigeminal. The ophthalmic division is in the lower part of the nucleus, and the mandibular branch is in the upper part. The large rostral head is the main sensory nucleus. The caudal tapered part is the spinal tract, which is continuous with substantia gelatinosa of Rolando in the spinal cord. The spinal tract is the sensory nucleus, primarily for pain and temperature. The main sensory nucleus serves mostly for discrimination sense.\n [1, 2, 3, 4, 5] The motor nucleus is ventromedial to the sensory nucleus. It lies near the lateral angle of the fourth ventricle in the rostral part of the pons. The mesencephalic nucleus is in the midbrain and receives proprioceptive fibers from all muscles of mastication. The main sensory nucleus receives its afferents (as the sensory root) from the semilunar ganglion through the lateral part of the pons ventral surface. Its axons cross to the other side, ascending to the thalamic nuclei to relay in the postcentral cerebral cortex. The descending sensory fibers from the semilunar ganglion course through the pons and medulla in the spinal tract of CN V to end in the nuclei of this tract (as far as the second cervical segment). (See tables 1 and 2, below.) The axons of these nuclei cross to the opposite side, ascending in the spinothalamic tract, to relay in the thalamic nuclei; from there, they end in the cerebral cortex. The sensory nucleus of CN V is connected to other motor nuclei of the pons and medulla. In addition, the descending sensory spinal tract receives somatic sensory fibers from CNs VII, IX, and X. The proprioceptive fibers of CN V arise from the muscles of mastication and the extraocular muscles. They terminate in the mesencephalic nucleus. This nucleus has connections to the motor nucleus of CN V. The motor nucleus of CN V receives cortical fibers for voluntary control of the muscles of mastication. These fibers are mostly crossed. It also receives input from the mesencephalic and sensory nuclei. The axons emerge anterior to the sensory root from the lateral surface of the pons. This motor root joins the semilunar ganglion together with the sensory root. The semilunar (gasserian or trigeminal) ganglion is the great sensory ganglion of CN V. It contains the sensory cell bodies of the 3 branches of the trigeminal nerve (the ophthalmic, mandibular, and maxillary divisions). The ophthalmic and maxillary nerves are purely sensory. The mandibular nerve has sensory and motor functions. The gasserian ganglion lies in a depression on the petrous apex, within a dural fold called the Meckel cave. The sensory roots of the 3 branches of CN V are received anteriorly. They then pass from the posterior aspect of the ganglion to the pons. The motor root passes under the ganglion to join the sensory division of the mandibular nerve and exits the skull through foramen ovale. The carotid plexus contributes sympathetic fibers to the gasserian ganglion. Burkett et al successfully visualized trigeminal fibers entering the pons at the nerve root entry zone (NREZ) and descending through the spinal trigeminal tract using robust diffusion-tensor imaging (DTI). Such protocols contribute to our understanding of the anatomical distribution within the brainstem and is a potentially new neurosurgical planning tool.\n [6] Table 1. Summary of the Components, Function, Central Connections, Cell Bodies, and Peripheral Distribution of CN V. (Open Table in a new window) Components Function Central connection Cell bodies Peripheral distribution Afferent general somatic General sensibility Sensory nucleus V Gasserian ganglion Sensory branches of the ophthalmic, maxillary, and mandibular nerves to skin, mucous membranes of the face and head Efferent special visceral Mastication Motor nucleus V Motor nucleus V Branches to temporalis, masseter, pterygoids, mylohyoid, tensor tympani, and palati Afferent proprioceptive Muscular sensibility Mesencephalic nucleus V Mesencephalic nucleus V Sensory endings in muscles of mastication Table 2. Summary of the Types of Fibers, Function, and Pathways of the Trigeminal Nerve. (Open Table in a new window) Type Function Pathway Branchial motor Motor to muscles of mastication CN V innervates the muscles of mastication, mylohyoid, tensor tympani, tensor veli palate, anterior belly of digastric General sensory Sensory from surface of head and neck, sinuses, meninges and TM The Gasserian ganglion receives the ophthalmic, maxillary and mandibular divisions of CN V and sympathetic fibers from the carotid plexus and sends branches to the dura. The four accessory ganglia are anatomically but not functionally associated with CN V",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/28/11428tn.jpg"
        ]
    },
    "Upper GI Tract Anatomy": {
        "description": "The GI, or digestive, tract extends from mouth to anus (see the image below). The division of the GI tract into upper and lower is a matter of some confusion and debate. On embryologic grounds, the GI tract should be divided into upper (mouth to major papilla in the duodenum), middle (duodenal papilla to mid-transverse colon), and lower (mid-transverse colon to anus), according to the derivation of these 3 areas from the foregut, midgut, and hindgut, respectively. Nevertheless, the GI tract is conventionally divided into upper (mouth to ileum) and lower (cecum to anus). From the point of view of GI bleeding, however, the demarcation between the upper and lower GI tract is the duodenojejunal (DJ) junction (ligament of Treitz); bleeding above the DJ junction is called upper GI bleeding, and that below the DJ junction is called lower GI bleeding.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/58/12158tn.jpg"
        ]
    },
    "Ureter Anatomy": {
        "description": "The ureters are paired muscular ducts with narrow lumina that carry urine from the kidneys to the bladder. An understanding of the anatomic relations of the ureters is critical to the practice of urology, as well as to the disciplines of gynecologic, vascular, and general surgery. The ureter serves as a critical landmark and is intimately involved with other vessels and organs, making accidental ureteral injury a dreaded consequence of surgery (see the image below). Knowledge of the microscopic anatomy and vascular supply of the ureter are essential during manipulation of the ureter.\n [1, 2, 3, 4] The ureter is subject to natural variation such as duplication. Pathologic variants of the ureter are also prevalent and can manifest as urinary obstruction, renal failure, and infection.\n [5, 6, 7] Increasingly, aberrant ureteral anatomy can be identified on antenatal ultrasonography, enabling early medical and surgical intervention.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/33/12733tn.jpg"
        ]
    },
    "Uterine Tube (Fallopian Tube) Anatomy": {
        "description": "The uterine tubes, also known as oviducts or fallopian tubes, are the female structures that transport the ova from the ovary to the uterus each month. In the presence of sperm and fertilization, the uterine tubes transport the fertilized egg to the uterus for implantation. The uterine tubes are uterine appendages located bilaterally at the superior portion of the uterine cavity. These tubes exit the uterus through an area referred to as the cornua, forming a connection between the endometrial and peritoneal cavities. Each uterine tube is approximately 10 cm in length and 1 cm in diameter and is situated within the mesosalpinx. The mesosalpinx is a fold in the broad ligament. The distal portion of the uterine tube ends in an orientation encircling the ovary. The primary function of the uterine tubes is to transport sperm toward the egg, which is released by the ovary, and to then allow passage of the fertilized egg back to the uterus for implantation.\n [1] A uterine tube contains 3 parts. The first segment, closest to the uterus, is called the isthmus. The second segment is the ampulla, which becomes more dilated in diameter and is the most common site for fertilization. The final segment, located farthest from the uterus, is the infundibulum. The infundibulum gives rise to the fimbriae, fingerlike projections that are responsible for picking up the egg released by the ovary. The arterial supply to the uterine tubes is from branches of the uterine and ovarian arteries; these small vessels are located within the mesosalpinx. The nerve supply to the uterine tubes is via both sympathetic and parasympathetic fibers. Sensory fibers run from thoracic segments 11-12 (T11-T12) and lumbar segment 1 (L1). Lymphatic drainage of the uterine tubes is through the iliac and lateral aortic nodes.\n [2, 3] Both ultrasonography and hysterosalpingography can be useful in diagnosing uterine anomalies.\n [4] Histologically, the uterine tubes are composed of 3 layers—the mucosa, muscularis, and serosa. The 3 different cell types within the mucosa of the uterine tubes include the columnar ciliated epithelial cells (25%), secretory cells (60%), and narrow peg cells (< 10%). The mucosa has many folds, called plicae, which are most evident in the ampulla. The next layer is the muscularis, which is a layer of smooth muscle that surrounds the mucosa. The serosa is the outermost layer; it is primarily visceral peritoneum.\n [5]",
        "image_urls": []
    },
    "Uterus Anatomy": {
        "description": "The anatomy of the uterus consists of the following 3 tissue layers (see the following image): The inner layer, called the endometrium, is the most active layer and responds to cyclic ovarian hormone changes; the endometrium is highly specialized and is essential to menstrual and reproductive function The middle layer, or myometrium, makes up most of the uterine volume and is the muscular layer, composed primarily of smooth muscle cells The outer layer of the uterus, the serosa or perimetrium, is a thin layer of tissue made of epithelial cells that envelop the uterus The uterus is a dynamic female reproductive organ that is responsible for several reproductive functions, including menses, implantation, gestation, labor, and delivery. It is responsive to the hormonal milieu within the body, which allows adaptation to the different stages of a woman’s reproductive life. The uterus adjusts to reflect changes in ovarian steroid production during the menstrual cycle and displays rapid growth and specialized contractile activity during pregnancy and childbirth. It can also remain in a relatively quiescent state during the prepubertal and postmenopausal years.\n [1, 2] The embryonic origin and development of the uterus is relatively complex. Until approximately 8 weeks' gestation, primordia for both male and female internal genitalia—the mesonephric (Wolffian) and paramesonephric (Mullerian) ducts, respectively—coexist in the embryo. The sexual differentiation process involves multiple steps in which hormonal signals, growth factors, and specific genetic influences are required. In the female embryo, due to the absence of a Y chromosome and lack of exposure to testosterone from functional testicular tissue, the normal developmental sequence of events results in fusion and canalization of the paramesonephric (Mullerian) ducts in the midline pelvis to form the female pelvic organs. Meanwhile, regression of the mesonephric (Wolffian) ducts occurs. Abnormalities in this process may occur during embryogenesis, which can result in the range of known paramesonephric anomalies.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/39/12739tn.jpg"
        ]
    },
    "Vaginal Anatomy": {
        "description": "The vagina is a functional organ of the female reproductive organ system. It extends from the vulva externally to the uterine cervix internally and is located within the pelvis, anterior to the rectum and posterior to the urinary bladder. The vagina lies at a 90° angle in relation to the uterus and is held in place by endopelvic fascia and ligaments. It is a potential space that is easily distended. The vaginal lining is called rugae, which are situated in folds throughout. These allow for distention, especially during childbearing and coitus. The structure of the vagina is a network of connective, membranous, and erectile tissues. The sphincter urethrae and the transverse perineus muscles, perineal membrane, and pelvic diaphragm support the vagina. The term urogenital diaphragm is no longer used; formerly, it included the sphincter urethrae and the deep transverse perineus muscle, together with their inferior fascia, the perineal membrane. These muscles are innervated by perineal branches of the pudendal nerve. The pelvic diaphragm primarily refers to the levator ani and coccygeus muscles and is innervated by branches of S2-S4 from the sacral plexus. The vasculature of the vagina is supplied primarily by the vaginal artery, a branch of the anterior division of the internal iliac artery. Several of these arteries may be found on either side of the pelvis to richly supply the vagina. The nerve supply to the vagina is primarily from the autonomic nervous system. Sensory fibers arise from the pudendal nerve, and pain fibers are from sacral nerve roots. Lymphatic drainage of the vagina is generally to the external iliac nodes (upper third of the vagina), the common and internal iliac nodes (middle third), and the superficial inguinal and perirectal nodes (lower third).\n [1, 2, 3] The American Urogynecologic Society has published various scholarly works based on cadaver dissections that describe the normal and abnormal anatomic relationships and quantification of defects that involve different structures of human female pelvic support and continence mechanisms.",
        "image_urls": []
    },
    "Vagus Nerve Anatomy": {
        "description": "The vagus nerve is the longest cranial nerve. It contains motor and sensory fibers and, because it passes through the neck and thorax to the abdomen, has the widest distribution in the body. It contains somatic and visceral afferent fibers, as well as general and special visceral efferent fibers. (See Table 1, below.) Table 1. Summary of Central Connections, Components, Function, and Peripheral Distribution of the Vagus Nerve (Open Table in a new window) Components Function Central connection Cell bodies Peripheral distribution Branchial motor (efferent special visceral) Swallowing, phonation Nucleus ambiguus Nucleus ambiguus Pharyngeal branches, superior and inferior laryngeal nerves Visceral motor (efferent general visceral) Involuntary muscle and gland control Dorsal motor nucleus X Dorsal motor nucleus X Cardiac, pulmonary, esophageal, gastric, celiac plexuses, and muscles, and glands of the digestive tract Visceral sensory (afferent general visceral) Visceral sensibility Nucleus tractus solitarius Inferior ganglion X Cervical, thoracic, abdominal fibers, and carotid and aortic bodies Visceral sensory (afferent special visceral) Taste Nucleus tractus solitarius Inferior ganglion X Branches to epiglottis and taste buds General sensory (afferent general somatic) Cutaneous sensibility Nucleus spinal tract V Superior ganglion X Auricular branch to external ear, meatus, and tympanic membrane The vagus nerve exits from the medulla oblongata in the groove between the olive and the inferior cerebellar peduncle. It leaves the skull through the middle compartment of the jugular foramen, where it has upper and lower ganglionic swellings, which are the sensory ganglia of the nerve. The superior ganglion (jugular) is less than 0.5 cm in diameter, while the inferior (nodose) ganglion is larger (2.5 cm) and lies 1 cm distal to the superior ganglion (see the image below). The vagus nerve is joined by the cranial root of the accessory nerve (cranial nerve XI), just below the inferior ganglion. (See the images below.)\n [1, 2, 3, 4] The vagus nerve descends vertically within the carotid sheath posterolateral to the internal and common carotid arteries and medial to the internal jugular vein (IJV) at the root of the neck. The right vagus crosses in front of the first part of the subclavian artery and then travels into the fat behind the innominate vessels. It then reaches the thorax on the right side of the trachea, which separates it from the right pleura. It then inclines behind the hilum of the right lung and courses medially toward the esophagus to form the esophageal plexus with the left vagus nerve. (See the image below.) The left vagus crosses in front of the left subclavian artery to enter the thorax between the left common carotid and subclavian arteries. It descends on the left side of the aortic arch, which separates it from the left pleura, and travels behind the phrenic nerve. It courses behind the root of the left lung and then deviates medially and downwards to reach the esophagus and form the esophageal plexus by joining the opposite (right) vagus nerve. The anterior and posterior gastric nerves are then formed from the esophageal plexus. The anterior gastric is formed mainly from the left vagus, but it does contain fibers from the right vagus. Similarly, the posterior gastric nerve is formed mainly from the right vagus but contains fibers from the left vagus nerve. The gastric nerves supply all abdominal organs and the gastrointestinal tract ending just before the left colonic (splenic) flexure (see the images below). The meningeal branch arises at the superior ganglion and reenters the cranium through the jugular foramen to supply the posterior fossa dura. The auricular branch supplies sensations to the posterior aspect of the external ear (pinna) and the posterior part of the external auditory canal. It arises also from the superior ganglion and enters the mastoid canaliculus in the lateral part of the jugular foramen. It exits again through the tympanomastoid suture of the temporal bone to reach the skin. It communicates with branches of the seventh (facial) and ninth (glossopharyngeal) cranial nerves. The branches in the next consist of the following: Pharyngeal branches Superior laryngeal nerve Recurrent laryngeal nerve Superior cardiac nerve Pharyngeal branches The pharyngeal branches arise from the inferior ganglion and contain sensory and motor fibers. The motor fibers are contributed by cranial nerve XI. They reach the middle constrictor muscle after crossing between the external and internal carotid arteries. They reach the pharyngeal plexus formed by cranial nerve IX and the sympathetic chain. Branches of the pharyngeal plexus supply the pharyngeal muscles and mucous membrane and palate except for the tensor palatini muscle. The intercarotid plexus, at the carotid bifurcation, is also formed by vagal fibers from the pharyngeal plexus, joined by glossopharyngeal and sympathetic fibers. These vagal fibers and visceral afferents mediate impulses set up by the chemoreceptors in the carotid body. Superior laryngeal nerve The superior laryngeal nerve passes between the external and internal carotid arteries at the level of crossing of cranial nerve XII. At the tip of the hyoid, the superior laryngeal nerve divides into the external and internal branches. The internal laryngeal nerve pierces the thyrohyoid membrane to enter the larynx. The external nerve passes inferiorly with the superior thyroid vessels to the inferior pharyngeal constrictor muscle. The cricothyroid muscle is supplied by the external branch of the superior laryngeal nerve. The internal branch of the superior laryngeal supplies most of the mucosa above the glottis. It is divided into the following 3 divisions: First division - Supplies mucosa of the laryngeal surface of the epiglottis Middle division - Supplies the mucosa of the true and false vocal folds, as well as the aryepiglottic fold Inferior division - Supplies the arytenoid mucosa, anterior wall of the hypopharynx, upper esophageal sphincter, and part of the subglottis (the major part of the subglottis is innervated by the ipsilateral recurrent nerve) Recurrent laryngeal nerve The recurrent laryngeal nerve is also known as the inferior laryngeal nerve. The right nerve branches from the vagus at the root of the neck around the right subclavian artery. It courses superiorly in the tracheoesophageal groove to enter the larynx between the cricopharyngeus and the esophagus. The left recurrent laryngeal nerve has a similar course to the right recurrent, except that it loops around the aortic arch distal to the ligamentum arteriosus. The main trunk of the recurrent lies in a triangle bound laterally by the common carotid artery, the IJV, and the vagus nerve and medially by the trachea and esophagus. The recurrent nerve passes under the posterior suspensory ligament of Berry (located on either side of the trachea, extending from the cricoid cartilage and the first 2 tracheal rings to the posteromedial aspect of the thyroid gland), before entering the larynx (see the image below). A few variations may occur in this area (see Natural Variants). All the intrinsic laryngeal musculature is supplied by the ipsilateral recurrent nerve except the cricothyroid muscle, which is supplied by the superior laryngeal nerve. The interarytenoid muscle is the only one that receives a bilateral supply (ie, from the left and right recurrent laryngeal nerves). The ramus communicans, or nerve of Galen, connects the superior and the recurrent laryngeal nerves. It provides the tracheal and esophageal mucosa and smooth muscle with visceral motor input. Superior cardiac nerve The superior cardiac nerve is made up of 2-3 branches. They communicate with the sympathetic fibers. The inferior cardiac branch is also called the ramus cardiaci inferiors. On the right side, it arises from the trunk of the vagus as it lies beside the trachea. On the left side, it originates from the recurrent laryngeal nerve only. These branches end in the deep part of the cardiac plexus. The anterior and posterior bronchial branches are distributed as 2-3 branches on the anterior surface of the root of the lung. They form the anterior pulmonary plexus after joining branches from the sympathetic trunk. The posterior bronchial branches are larger than the anterior and lie on the posterior surface of the root of the lung to form the posterior pulmonary plexus (with contributory sympathetic fibers) as well. The esophageal branches are anterior and posterior branches. Together they form the esophageal plexus. The posterior surface of the pericardium is supplied by filaments from this plexus. The gastric branches (rami gastrici) supply the stomach. The right vagus forms the posterior gastric plexus and the left forms the anterior gastric plexus. The branches lie on the posteroinferior and the anterosuperior surfaces, respectively. The celiac branches (rami celiaci) are derived mainly from the right vagus nerve. They join the celiac plexus and supply the pancreas, spleen, kidneys, adrenals, and intestine. The hepatic branches originate from the left vagus. They join the hepatic plexus and through it are distributed to the liver.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/79/11479tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/80/11480tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/81/11481tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/82/11482tn.jpg"
        ]
    },
    "Venous Drainage Anatomy": {
        "description": "Grossly, the venous system is composed of venules and small and great veins, which serve to return blood from tissues to the heart (see the image below). The systemic venous system brings deoxygenated blood from tissues and organs back to the right atrium of the heart, whereas the pulmonary venous system brings oxygenated blood from the pulmonary circulation back to the left atrium of the heart. The systemic venous channels are further classified as superficial veins, deep veins, or venous sinuses. The superficial, or cutaneous, veins reside just beneath the surface of the skin. They channel blood from cutaneous tissues to deep veins via perforations in the deep fascia. Most of the deep veins share routes with the arteries, and many are enclosed in the same sheaths. Venous sinuses are present only within the skull.\n [1, 2]",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/59/12159tn.jpg"
        ]
    },
    "Ventricles of the Brain": {
        "description": "The ventricles of the brain are a communicating network of cavities filled with cerebrospinal fluid (CSF) and located within the brain parenchyma. The ventricular system is composed of 2 lateral ventricles, the third ventricle, the cerebral aqueduct, and the fourth ventricle (see the images below). The choroid plexuses are located in the ventricles produce CSF, which fills the ventricles and subarachnoid space, following a cycle of constant production and reabsorption.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/22/12422tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/23/12423tn.jpg"
        ]
    },
    "Vestibular System Anatomy": {
        "description": "The peripheral vestibular system is an integral part of the labyrinth that lies in the otic capsule in the petrous portion of the temporal bone. The vestibular system, which is the system of balance, consists of 5 distinct end organs: 3 semicircular canals that are sensitive to angular accelerations (head rotations) and 2 otolith organs that are sensitive to linear (or straight-line) accelerations.\n [1] The semicircular canals are arranged as a set of 3 mutually orthogonal sensors; that is, each canal is at a right angle to the other 2. This is similar to the way 3 sides of a box meet at each corner and are at a right angle to one another. Furthermore, each canal is maximally sensitive to rotations that lie in the plane of the canal. The result of this arrangement is that 3 canals can uniquely specify the direction and amplitude of any arbitrary head rotation. The canals are organized into functional pairs, wherein both members of the pair lie in the same plane. Any rotation in that plane is excitatory to one of the members of the pair and inhibitory to the other. The otolith organs include the utricle and the saccule. The utricle senses motion in the horizontal plane (eg, forward-backward movement, left-right movement, or a combination thereof). The saccule senses motions in the sagittal plane (eg, up-down movement). (See the images below.)",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/80/25180tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/81/25181tn.jpg"
        ]
    },
    "Visual System Anatomy": {
        "description": "The visual system includes the eyes, connecting pathways through to the visual cortex, and other parts of the brain (see the image below). The neural signals initially processed by the retina travel via the axons of the ganglion cells through the optic nerves, dividing and partially crossing over into the optic chiasm and then travelling via the optic tracts to the lateral geniculate nucleus (LGN). From the LGN, the signals continue to the primary visual cortex, where further visual processing takes place.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/00/12600tn.jpg"
        ]
    },
    "Vocal Cord and Voice Box Anatomy": {
        "description": "The vocal folds, also known as vocal cords, are located within the larynx (also colloquially known as the voice box) at the top of the trachea. They are open during inhalation and come together to close during swallowing and phonation. When closed, the vocal folds may vibrate and modulate the expelled airflow from the lungs to produce speech and singing. A video displaying the anatomy of the vocal cords and voice box is provided below.",
        "image_urls": []
    },
    "Wrist Joint Anatomy": {
        "description": "The wrist is a complex joint that bridges the hand to the forearm. It is actually a collection of multiple bones and joints. The bones comprising the wrist include the distal ends of the radius and ulna, 8 carpal bones, and the proximal portions of the 5 metacarpal bones (see the images below). All of these bones participate in complex articulations that allow variable mobility of the hand. Relative to the forearm, the hand is capable of 3 degrees of freedom: (1) flexing and extending, (2) pronating and supinating, and (3) deviating ulnarly or radially.\n [1, 6, 7, 8, 9] In order to maintain mobility without sacrificing stability, the wrist joint has a complex configuration of ligaments, as shown in the following images.",
        "image_urls": [
            "https://img.medscapestatic.com/pi/meds/ckb/65/12165tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/66/12166tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/70/12170tn.jpg",
            "https://img.medscapestatic.com/pi/meds/ckb/71/12171tn.jpg"
        ]
    }
}